with open('source_lineage.txt', 'a', encoding='utf-8') as f:
    f.write("""
أعقاب شارح البحر:
                 أعقاب = 
عثمان بن الحسن بن بشر بن إبراهيم بن عبد الرحمن الجنيد
34/ 1 – عثمان بن الحسن بن بشر بن إبراهيم بن عبد الرحمن الجنيد
وأعقب:
35/ 1 – أحمد  
35/ 1 – أحمد بن عثمان بن الحسن بن بشر بن إبراهيم بن عبد الرحمن الجنيد 
وأعقب :
36/ 1 – علي      36/ 2 – عبد الله  
36/ 1 – علي بن أحمد بن عثمان بن الحسن 
وأعقب :
37/ 1 – عبد الله 37/ 2 – محمد
37/ 1 – عبد الله بن علي بن أحمد بن عثمان بن الحسن
وأعقب:
38/ 1 – عبد الإله     38/ 2 – يحيى 
38/ 3 – عبد المجيد  38/ 4 – عبد الملك (×) 
38/ 5 – حسن (×)    38/ 6 – الجنيد  
38/ 1 – عبد الإله بن عبد الله بن علي بن أحمد بن عثمان بن الحسن 
وأعقب:
39/ 1 – عبد الرحمن  39/ 2 – عبد الوهاب  
39/ 3 – عبد الغني 
39/ 1 – عبد الرحمن بن عبد الإله بن عبد الله 
وأعقب:
40/ 1 – محمد ( شهيد )    40/ 2 – عبده 
40/ 3 – عبد الغني            40/ 4 – عبد الجليل 
40/ 5 – عبد المجيد           40/ 6 – منير 
40/ 7 – جميل                  40/ 8 – أحمد 
40/ 9 – عبد الوهاب         40/ 10 – يوسف  
40/ 11 – عادل (شهيد) 
40/ 2 – عبده بن عبد الرحمن بن عبد الإله 
وأعقب:
41/ 1 – عبد الملك 41/ 2 – عبد الرحمن  
40/ 3 – عبد الغني بن عبد الرحمن بن عبد الإله 
وأعقب:
41/ 1 – عبد الرحمن 
40/ 4 – عبد الجليل بن عبد الرحمن بن عبد الإله 
وأعقب:
41/ 1 – عبد الرحمن 41/ 2 – محمد 
40/ 5 – عبد المجيد بن عبد الرحمن بن عبد الإله 
وأعقب:
41/ 1 – محمد  
40/ 6 – منير بن عبد الرحمن بن عبد الإله 
وأعقب:
41/ 1 – محمد 41/ 2 – أحمد 
40/ 7 – جميل بن عبد الرحمن بن عبد الإله 
وأعقب:
41/ 1 – محمد 41/ 2 – أحمد  
40/ 8 – أحمد بن عبد الرحمن بن عبد الإله 
وأعقب:
41/ 1 – محمد 
40/ 9 – عبد الوهاب بن عبد الرحمن بن عبد الإله 
وأعقب:
41/ 1 – عبد الرحمن 41/ 2 – محمد  
40/ 10 – يوسف بن عبد الرحمن بن عبد الإله 
وأعقب:
41/ 1 – يعقوب 
40/ 11 – عادل بن عبد الرحمن بن عبد الإله 
وأعقب:
41/ 1 – محمد 
ــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــ 
39/ 2 – عبد الوهاب بن عبد الإله بن عبد الله بن علي بن أحمد بن عثمان 
وأعقب:
40/ 1 – محمد          40/ 2 – عبد الله 
40/ 3 – عبد القوي 40/ 4 – عبد الرحمن 
40/ 5 – عبد الحكيم 
40/ 1 – محمد بن عبد الوهاب بن عبد الإله بن عبد الله  
وأعقب:
41/ 1 – عبد الرحمن      41/ 2 – عبد الوهاب 
41/ 3 – عبد الإله         41/ 4 – عبد العزيز 
40/ 2 – عبد الله بن عبد الوهاب بن عبد الإله بن عبد الله  
وأعقب:
41/ 1 – عبد الوهاب   41/ 2 – عبد الملك 
41/ 3 – حمزة           41/ 4 – هشام  
40/ 3 – عبد القوي بن عبد الوهاب بن عبد الإله بن عبد الله  
وأعقب:
41/ 1 – عبد الوهاب    41/ 2 – محمد 
41/ 3 – مجد 
40/ 4 – عبد الرحمن بن عبد الوهاب بن عبد الإله بن عبد الله  
وأعقب:
41/ 1 – عبد الوهاب 41/ 2 – محمد  
40/ 5 – عبد الحكيم بن عبد الوهاب بن عبد الإله بن عبد الله  
وأعقب:
41/ 1 – أسامة  
ـــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــ 
39/ 3 – عبد الغني بن عبد الإله بن عبد الله بن علي بن أحمد بن عثمان 
وأعقب:
40/ 1 – أحمد          40/ 2 – محمد 
40/ 3 – عبد الوهاب  40/ 4 – يوسف 
40/ 5 – عبد الإله      40/ 6 – عبد الحميد 
40/ 1 – أحمد بن عبد الغني بن عبد الإله بن عبد الله  
وأعقب:
41/ 1 – معاذ  41/ 2 – محمد  
40/ 2 – محمد بن عبد الغني بن عبد الإله بن عبد الله  
وأعقب:
41/ 1 – عبد الغني  
40/ 3 – عبد الوهاب بن عبد الغني بن عبد الإله بن عبد الله  
وأعقب:
41/ 1 – أسامة 41/ 2 – عبد الغني  
40/ 4 – يوسف بن عبد الغني بن عبد الإله بن عبد الله  
وأعقب:
41/ 1 – يونس 
40/ 5 – عبد الإله بن عبد الغني بن عبد الإله بن عبد الله  
وأعقب:
41/ 1 – عبد الغني 
40/ 6 – عبد الحميد بن عبد الغني بن عبد الإله بن عبد الله  
وأعقب:
41/ 1 – عبد الغني 
ــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــ 
38/ 2 – يحيى بن عبد الله بن علي بن أحمد بن عثمان بن الحسن 
وأعقب:
39/ 1 – عبد الله        39/ 2 – أحمد (×) 
39/ 3 – عبد الرحمن 39/ 4 – محمد 
39/ 5 – عبد المجيد 
39/ 1 – عبد الله بن يحيى بن عبد الله بن علي بن أحمد بن عثمان 
وأعقب:
40/ 1 – يحيى     40/ 2 – عبد الرحمن 
40/ 3 – محمد   40/ 4 – أحمد 
40/ 1 – يحيى بن عبد الله بن يحيى 
وأعقب:
41/ 1 – عبد الله 41/ 2 – محمد 
41/ 3 – إبراهيم  
40/ 2 – عبد الرحمن بن عبد الله بن يحيى 
وأعقب:
41/ 1 – أحمد 41/ 2 – محمد  
40/ 3 – محمد بن عبد الله بن يحيى 
وأعقب:
41/ 1 – عبد الله 41/ 2 – يحيى  
40/ 4 – أحمد بن عبد الله بن يحيى 
وأعقب:
41/ 1 – عبد الله 
ــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــ 
39/ 3 – عبد الرحمن بن يحيى بن عبد الله بن علي بن أحمد بن عثمان 
وأعقب:
40/ 1 – أحمد      40/ 2 – يحيى 
40/ 3 – عبد الله 40/ 4 – محمد 
40/ 1 – أحمد بن عبد الرحمن بن يحيى 
وأعقب:
41/ 1 – عبد الرحمن 41/ 2 – يحيى  
40/ 2 – يحيى بن عبد الرحمن بن يحيى 
وأعقب:
41/ 1 – عبد الرحمن 41/ 2 – أحمد  
40/ 3 – عبد الله بن عبد الرحمن بن يحيى 
وأعقب:
41/ 1 – يحيى 
40/ 4 – محمد بن عبد الرحمن بن يحيى 
وأعقب:
41/ 1 – عبد الرحمن 
ــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــ 
39/ 4 – محمد بن يحيى بن عبد الله بن علي بن أحمد بن عثمان 
وأعقب:
40/ 1 – يحيى       40/ 2 – عبد الله 
40/ 3 – عبد الرحمن 40/ 4 – أحمد 
40/ 1 – يحيى بن محمد بن يحيى 
وأعقب:
41/ 1 – محمد 41/ 2 – عبد الله  
40/ 2 – عبد الله بن محمد بن يحيى 
وأعقب:
41/ 1 – محمد 41/ 2 – يحيى  
40/ 3 – عبد الرحمن بن محمد بن يحيى 
وأعقب:
41/ 1 – محمد 
40/ 4 – أحمد بن محمد بن يحيى 
وأعقب:
41/ 1 – محمد 
ــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــ 
39/ 5 – عبد المجيد بن يحيى بن عبد الله بن علي بن أحمد بن عثمان 
وأعقب:
40/ 1 – يحيى     40/ 2 – عبد الله 
40/ 3 – محمد   40/ 4 – أحمد 
40/ 1 – يحيى بن عبد المجيد بن يحيى 
وأعقب:
41/ 1 – عبد المجيد 
40/ 2 – عبد الله بن عبد المجيد بن يحيى 
وأعقب:
41/ 1 – عبد المجيد 
40/ 3 – محمد بن عبد المجيد بن يحيى 
وأعقب:
41/ 1 – عبد المجيد 
40/ 4 – أحمد بن عبد المجيد بن يحيى 
وأعقب:
41/ 1 – عبد المجيد 
ــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــ 
38/ 3 – عبد المجيد بن عبد الله بن علي بن أحمد بن عثمان بن الحسن 
وأعقب:
39/ 1 – عبد الله        39/ 2 – أحمد 
39/ 3 – عبد الرحمن 39/ 4 – محمد 
39/ 1 – عبد الله بن عبد المجيد بن عبد الله 
وأعقب:
40/ 1 – عبد المجيد 40/ 2 – محمد 
40/ 1 – عبد المجيد بن عبد الله بن عبد المجيد 
وأعقب:
41/ 1 – عبد الله 
40/ 2 – محمد بن عبد الله بن عبد المجيد 
وأعقب:
41/ 1 – عبد الله 
39/ 2 – أحمد بن عبد المجيد بن عبد الله 
وأعقب:
40/ 1 – عبد المجيد 40/ 2 – محمد 
40/ 1 – عبد المجيد بن أحمد بن عبد المجيد 
وأعقب:
41/ 1 – أحمد 
40/ 2 – محمد بن أحمد بن عبد المجيد 
وأعقب:
41/ 1 – أحمد 
39/ 3 – عبد الرحمن بن عبد المجيد بن عبد الله 
وأعقب:
40/ 1 – عبد المجيد 
40/ 1 – عبد المجيد بن عبد الرحمن بن عبد المجيد 
وأعقب:
41/ 1 – عبد الرحمن 
39/ 4 – محمد بن عبد المجيد بن عبد الله 
وأعقب:
40/ 1 – عبد المجيد 
40/ 1 – عبد المجيد بن محمد بن عبد المجيد 
وأعقب:
41/ 1 – محمد 
ــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــ 
38/ 6 – الجنيد بن عبد الله بن علي بن أحمد بن عثمان بن الحسن 
وأعقب:
39/ 1 – عبد الله        39/ 2 – أحمد 
39/ 3 – عبد الرحمن 
39/ 1 – عبد الله بن الجنيد بن عبد الله 
وأعقب:
40/ 1 – الجنيد 40/ 2 – محمد 
40/ 1 – الجنيد بن عبد الله بن الجنيد 
وأعقب:
41/ 1 – عبد الله 
40/ 2 – محمد بن عبد الله بن الجنيد 
وأعقب:
41/ 1 – عبد الله 
39/ 2 – أحمد بن الجنيد بن عبد الله 
وأعقب:
40/ 1 – الجنيد 
40/ 1 – الجنيد بن أحمد بن الجنيد 
وأعقب:
41/ 1 – أحمد 
39/ 3 – عبد الرحمن بن الجنيد بن عبد الله 
وأعقب:
40/ 1 – الجنيد 
40/ 1 – الجنيد بن عبد الرحمن بن الجنيد 
وأعقب:
41/ 1 – عبد الرحمن 
ــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــ 
37/ 2 – محمد بن علي بن أحمد بن عثمان بن الحسن 
وأعقب:
38/ 1 – علي          38/ 2 – عبد الله 
38/ 3 – أحمد (×)  38/ 4 – يحيى 
38/ 1 – علي بن محمد بن علي بن أحمد بن عثمان 
وأعقب:
39/ 1 – محمد        39/ 2 – عبد الله 
39/ 3 – أحمد 
39/ 1 – محمد بن علي بن محمد 
وأعقب:
40/ 1 – علي 40/ 2 – أحمد 
40/ 1 – علي بن محمد بن علي 
وأعقب:
41/ 1 – محمد 
40/ 2 – أحمد بن محمد بن علي 
وأعقب:
41/ 1 – محمد 
39/ 2 – عبد الله بن علي بن محمد 
وأعقب:
40/ 1 – علي 
40/ 1 – علي بن عبد الله بن علي 
وأعقب:
41/ 1 – عبد الله 
39/ 3 – أحمد بن علي بن محمد 
وأعقب:
40/ 1 – علي 
40/ 1 – علي بن أحمد بن علي 
وأعقب:
41/ 1 – أحمد 
ــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــ 
38/ 2 – عبد الله بن محمد بن علي بن أحمد بن عثمان 
وأعقب:
39/ 1 – محمد        39/ 2 – علي 
39/ 3 – أحمد 
39/ 1 – محمد بن عبد الله بن محمد 
وأعقب:
40/ 1 – عبد الله 
40/ 1 – عبد الله بن محمد بن عبد الله 
وأعقب:
41/ 1 – محمد 
39/ 2 – علي بن عبد الله بن محمد 
وأعقب:
40/ 1 – عبد الله 
40/ 1 – عبد الله بن علي بن عبد الله 
وأعقب:
41/ 1 – علي 
39/ 3 – أحمد بن عبد الله بن محمد 
وأعقب:
40/ 1 – عبد الله 
40/ 1 – عبد الله بن أحمد بن عبد الله 
وأعقب:
41/ 1 – أحمد 
ــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــ 
38/ 4 – يحيى بن محمد بن علي بن أحمد بن عثمان 
وأعقب:
39/ 1 – محمد 39/ 2 – عبد الله 
39/ 1 – محمد بن يحيى بن محمد 
وأعقب:
40/ 1 – يحيى 
40/ 1 – يحيى بن محمد بن يحيى 
وأعقب:
41/ 1 – محمد 
39/ 2 – عبد الله بن يحيى بن محمد 
وأعقب:
40/ 1 – يحيى 
40/ 1 – يحيى بن عبد الله بن يحيى 
وأعقب:
41/ 1 – عبد الله 
ــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــ 
36/ 2 – عبد الله بن أحمد بن عثمان بن الحسن 
وأعقب:
37/ 1 – أحمد 37/ 2 – محمد 
37/ 1 – أحمد بن عبد الله بن أحمد بن عثمان 
وأعقب:
38/ 1 – عبد الله 38/ 2 – علي 
38/ 1 – عبد الله بن أحمد بن عبد الله 
وأعقب:
39/ 1 – أحمد 
40/ 1 – أحمد بن عبد الله بن أحمد 
وأعقب:
41/ 1 – عبد الله 
38/ 2 – علي بن أحمد بن عبد الله 
وأعقب:
39/ 1 – أحمد 
40/ 1 – أحمد بن علي بن أحمد 
وأعقب:
41/ 1 – علي 
37/ 2 – محمد بن عبد الله بن أحمد بن عثمان 
وأعقب:
38/ 1 – عبد الله 38/ 2 – أحمد 
38/ 1 – عبد الله بن محمد بن عبد الله 
وأعقب:
39/ 1 – محمد 
40/ 1 – محمد بن عبد الله بن محمد 
وأعقب:
41/ 1 – عبد الله 
38/ 2 – أحمد بن محمد بن عبد الله 
وأعقب:
39/ 1 – محمد 
40/ 1 – محمد بن أحمد بن محمد 
وأعقب:
41/ 1 – أحمد 
ــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــ 
                 أعقاب = 
مالك بن إبراهيم بن عبد الرحمن الجنيد
32/ 7 – مالك بن إبراهيم بن عبد الرحمن الجنيد (×)
عقبه انقرض ولم يبق منهم أحد
ــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــ 
                 أعقاب = 
علي بن إبراهيم بن عبد الرحمن الجنيد
32/ 3 – علي بن إبراهيم بن عبد الرحمن الجنيد
وأعقب:
33/ 1 – محمد 33/ 2 – أحمد 
33/ 1 – محمد بن علي بن إبراهيم بن عبد الرحمن الجنيد
وأعقب:
34/ 1 – علي 34/ 2 – عبد الرحمن 
34/ 1 – علي بن محمد بن علي بن إبراهيم
وأعقب:
35/ 1 – محمد 35/ 2 – يحيى 
35/ 1 – محمد بن علي بن محمد بن علي
وأعقب:
36/ 1 – أحمد 36/ 2 – عبد الله 
36/ 1 – أحمد بن محمد بن علي بن محمد
وأعقب:
37/ 1 – محمد 37/ 2 – علي 
37/ 1 – محمد بن أحمد بن محمد بن علي
وأعقب:
38/ 1 – أحمد 38/ 2 – عبد الله 
38/ 1 – أحمد بن محمد بن أحمد بن محمد
وأعقب:
39/ 1 – محمد 39/ 2 – عبد الرحمن 
39/ 1 – محمد بن أحمد بن محمد بن أحمد
وأعقب:
40/ 1 – أحمد 40/ 2 – علي 
40/ 1 – أحمد بن محمد بن أحمد بن محمد
وأعقب:
41/ 1 – محمد 
40/ 2 – علي بن محمد بن أحمد بن محمد
وأعقب:
41/ 1 – أحمد 
39/ 2 – عبد الرحمن بن أحمد بن محمد بن أحمد
وأعقب:
40/ 1 – محمد 40/ 2 – أحمد 
40/ 1 – محمد بن عبد الرحمن بن أحمد
وأعقب:
41/ 1 – عبد الرحمن 
40/ 2 – أحمد بن عبد الرحمن بن أحمد
وأعقب:
41/ 1 – عبد الرحمن 
ــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــ 
                 أعقاب = 
إسماعيل بن إبراهيم بن عبد الرحمن الجنيد
32/ 4 – إسماعيل بن إبراهيم بن عبد الرحمن الجنيد
وأعقب:
33/ 1 – أحمد 33/ 2 – محمد 
33/ 1 – أحمد بن إسماعيل بن إبراهيم
وأعقب:
34/ 1 – إسماعيل 34/ 2 – عبد الله 
34/ 1 – إسماعيل بن أحمد بن إسماعيل
وأعقب:
35/ 1 – محمد 35/ 2 – علي 
35/ 1 – محمد بن إسماعيل بن أحمد
وأعقب:
36/ 1 – أحمد 36/ 2 – إسماعيل 
36/ 1 – أحمد بن محمد بن إسماعيل
وأعقب:
37/ 1 – محمد 37/ 2 – عبد الله 
37/ 1 – محمد بن أحمد بن محمد
وأعقب:
38/ 1 – أحمد 38/ 2 – علي 
38/ 1 – أحمد بن محمد بن أحمد
وأعقب:
39/ 1 – محمد 39/ 2 – عبد الرحمن 
39/ 1 – محمد بن أحمد بن محمد
وأعقب:
40/ 1 – أحمد 40/ 2 – إسماعيل 
40/ 1 – أحمد بن محمد بن أحمد
وأعقب:
41/ 1 – محمد 
40/ 2 – إسماعيل بن محمد بن أحمد
وأعقب:
41/ 1 – أحمد 
ــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــ 
                 أعقاب = 
عبد الرحمن بن حسن بن حاجب بن إبراهيم بن عبد الرحمن الجنيد
33/ 1 – حاجب بن إبراهيم بن عبد الرحمن الجنيد
وأعقب:
34/ 1 – حسن 
34/ 1 – حسن بن حاجب بن إبراهيم بن عبد الرحمن الجنيد
وأعقب:
35/ 1 – عبد الرحمن 
35/ 1 – عبد الرحمن بن حسن بن حاجب بن إبراهيم
وأعقب:
36/ 1 – محمد 36/ 2 – أحمد 
36/ 1 – محمد بن عبد الرحمن بن حسن بن حاجب
وأعقب:
37/ 1 – عبد الرحمن 37/ 2 – علي 
37/ 1 – عبد الرحمن بن محمد بن عبد الرحمن
وأعقب:
38/ 1 – محمد 38/ 2 – أحمد 
38/ 1 – محمد بن عبد الرحمن بن محمد
وأعقب:
39/ 1 – عبد الرحمن 39/ 2 – عبد الله 
39/ 1 – عبد الرحمن بن محمد بن عبد الرحمن
وأعقب:
40/ 1 – محمد 40/ 2 – أحمد 
40/ 1 – محمد بن عبد الرحمن بن محمد
وأعقب:
41/ 1 – عبد الرحمن 
40/ 2 – أحمد بن عبد الرحمن بن محمد
وأعقب:
41/ 1 – عبد الرحمن 
ــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــ 
                 أعقاب = 
العيدروس بن عبد الرحمن الجنيد
31/ 2 – العيدروس بن عبد الرحمن الجنيد بن محمد جمال الدين
وأعقب:
32/ 1 – عبد الرحمن 32/ 2 – أحمد 
عقبه في تريم وحضرموت
ــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــ 
                 أعقاب = 
فاضل بن عبد الرحمن الجنيد
31/ 3 – فاضل بن عبد الرحمن الجنيد بن محمد جمال الدين
وأعقب:
32/ 1 – محمد 32/ 2 – علي 
عقبه في قدس والحجرية
ــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــ
""")
print("Complete text written!")
