with open('source_lineage.txt', 'a', encoding='utf-8') as f:
    f.write("""
أعقاب شارح البحر:

     أعقاب= 
فاضل بن عبد الله بن حيدر بن عبد الله بن علي بن جيلان بن عبَّاد 
وأعقب: 
40/ 1 – أحمد بن محمد بن فاضل 
وأعقب : 
41/ 1 – محمد 41/ 2 – فاضل  
41/ 1 – محمد بن أحمد بن محمد بن فاضل 
وأعقب : 
42/ 1 – إبراهيم  
40/ 2 – أحمد بن عبد العزيز بن فاضل 
وأعقب : 
41/ 1 - يوسف 41/ 2 – خليل 
41/ 3 - صفوان 41/ 4 – محمد   
41/ 5 - عمار    41/ 6 – عمرو 
40/ 2 – علي بن عبد العزيز بن فاضل 
وأعقب : 
41/ 1 - الحسين 41/ 2 – أسامة  
41/ 3 - مروان   41/ 3 – محمد 
40/ 2 - محمد بن عبد العزيز بن فاضل  
وأعقب : 
41/ 1 – 

40/ 3 – عبد السلام بن مهيوب بن فاضل 
وأعقب : 
41/ 1 – رضا 41/ 2 – مرتضى  
41/ 3 – محمد 
40/ 3 – وجيه بن مهيوب بن فاضل 
وأعقب : 
41/ 1 – محمد 
40/ 3 – معمر بن مهيوب بن فاضل 
وأعقب : 
41/ 1 – حيدر 
40/ 4 – نوري بن مهيوب بن فاضل 
وأعقب : 
41/ 1 – عبد الله  
40/ 4 – هاشم بن عبد الرحمن بن فاضل 
وأعقب : 
41/ 1 – مهند  
40/ 4 – محمود بن عبد الرحمن بن فاضل (شهيد) 
وأعقب : 
41/ 1 – جمال   
40/ 5 – عارف بن حمود بن فاضل 
وأعقب : 
41/ 1 - 
40/ 5 – رياض بن حمود بن فاضل 
وأعقب : 
41/ 1 – محمد 

أعقاب=
محمد بن سعيد بن  حيدر بن عبد الله بن علي بن جيلان بن عبَّاد 
وأعقب : 
39/ 1 – أمين بن محمد بن سعيد بن  حيدر محمد  
وأعقب : 
40/ 1 – محمد 
39/ 3 – محسن بن محمد بن سعيد بن حيدر 
وأعقب : 
40/ 1 – فضل  
أعقاب=
محسن بن حيدر بن عبد الله بن علي بن جيلان بن عبَّاد 
وأعقب : 
  40/ 1 – عبد الجليل بن محيا بن أحمد بن محسن بن  حيدر 

وأعقب : 
41/ 1 – محمد 
41/ 1 – محمد بن عبد الجليل بن محيا 
وأعقب : 
42/ 1 – مبروك  
40/ 2 – علي بن محيا بن أحمد بن محسن بن حيدر 

وأعقب : 
41/ 1 – عبد الله  41/ 2 – عبد الرحمن 
41/ 3 – أمين 41/ 4 – محمد 
41/ 1 – عبد الله بن علي بن محيا يد 
وأعقب : 
42/ 1 –    42/ 2 – 
41/ 2 – عبد الرحمن بن علي بن محيا 
وأعقب : 
42/ 1 – علي   42/ 2 – 

أعقاب=
عبد الرحمن بن محسن بن حيدر بن عبد الله بن علي  بن جيلان بن عبَّاد 
وأعقب:

40/ 1 – سعيد بن أحمد بن عبد الرحمن بن محسن بن  حيدر   
وأعقب : 
41/ 1 – محمد   41/ 2 – عبد الحكيم  
41/ 3 – خالد     41/ 4 – عمر 
41/ 5 – أحمد    41/ 6 – صلاح   
41/ 7 – موسى   
41/ 1 – محمد بن سعيد بن أحمد بن عبد الرحمن 
وأعقب : 
42/ 1 – 42/ 2 –
41/ 2 – عبد الحكيم بن سعيد بن أحمد  
وأعقب : 
42/ 1 – محمد 42/ 2 – أيمن   
41/ 3 – خالد بن سعيد بن أحمد بن عبد الرحمن 
وأعقب: 
42/ 1 – 
41/ 4 – عمر بن سعيد بن أحمد بن عبد الرحمن 
وأعقب : 
42/ 1 – الحمزة 42/ 2 – محمد   
41/ 5 – أحمد بن سعيد بن أحمد بن عبد الرحمن 
وأعقب : 
42/ 1 – 41 / 2 – 
40/ 2 – عبد الجليل بن أحمد بن عبد الرحمن 
وأعقب : 
41/ 1 – 41/ 2 – 
40/ 3 – عبد الله بن أحمد بن عبد الرحمن 
وأعقب: 
41/ 1 – سلمان  41/ 2 – محمد  
40/ 4 – عبد الكريم بن أحمد بن عبد الرحمن  
وأعقب : 
41/ 1 – زكريا  41/ 2 – أسامة  

أعقاب= 
عبد الغني بن حيدر بن عبد الله بن علي بن جيلان بن عبَّاد 
وأعقب : 
39/ 1 – محمد بن محمد بن عبد الغني بن حيدر   
وأعقب : 
40/ 1 – مروان 40/ 2 – يوسف 
40/ 3 -  

أعقاب = 
علي بن عبد الله بن علي بن جيلان بن عبَّاد 
وأعقب : 
39/ 1 – محمد بن عبد الرقيب بن محسن بن علي بن عبد الله بن علي بن جيلان 
وأعقب: 
40/ 1 – عبد الله     40/ 2 – أحمد  
40/ 3 – محي الدين   40/ 4 – عدنان 
40/ 5 – عايد        40/ 5 – حسيب 
40/ 1 – عبد الله بن محمد بن عبد الرقيب بن محسن  
وأعقب : 
41/ 1 – صفوان  41/ 2 – صخر   
41/ 3 – محمود      41/ 4 - عمر 
40/ 4 – عدنان بن  محمد بن عبد الرقيب بن محسن  
وأعقب : 
41/ 1 – محمد   
39/ 2 – قاسم بن عبد الرقيب بن محسن      
وأعقب : 
40/ 1 – أنيس       40/ 2 – حافظ  

40/ 3 – رياض           40/ 4 – مراد  
40/ 5 - أنس 
40/ 1 – أنيس بن قاسم بن عبد الرقيب 
وأعقب : 
41/ 1 – عبد الرحمن   41/ 2 – باسم    41/ 3 – بسام    
40/ 2 – حافظ بن قاسم بن عبد الرقيب 
وأعقب : 
41/ 1 – محمد   
40/ 3 – رياض بن قاسم بن عبد الرقيب 
وأعقب : 
41/ 1 – عمرو    
40/ 4 – مراد بن قاسم بن عبد الرقيب 
وأعقب : 
41/ 1 – محمد     
39/ 3 – عبد الهادي بن عبد الرقيب بن محسن  
وأعقب : 
40/ 1 – رمزي  40/ 2 – رضوان   
40/ 3 – محمد  40/ 4 – أحمد  
40/ 5 – أسامة  40/ 6 – أنس    
40/ 7 – معاذ   
40/ 1 – رمزي بن عبد الهادي بن عبد الرقيب 
وأعقب : 
41/ 1 – ضياء
 
أعقاب=
عبد اللطيف بن محسن بن علي بن عبد الله بن علي بن جيلان بن عبَّاد 
وأعقب : 
39/ 1 – أحمد بن عبد اللطيف بن محسن 
وأعقب : 
40/ 1 – عادل  
40/ 1 – عادل بن أحمد بن عبد اللطيف بن محسن 
وأعقب : 
41/ 1 – 
39/ 2 – طه بن عبد اللطيف بن محسن 
وأعقب : 
40/ 1 – بسام  40/ 2 – جلال   
40/ 3 – رضوان     40/ 4 – محمد  
40/ 5 – إدريس  40 / 6 – بليغ    
40/ 7 – اسامة    
40/ 1 – بسام بن طه بن عبد اللطيف  
وأعقب : 
41/ 1 – طاهر  41/ 2 – محمد       
39/ 3 – عبد العزيز بن عبد اللطيف بن محسن  
وأعقب : 
40/ 1 – بندر       40/ 2 – بلال   
40/ 3 – عمار       40/ 4 – مشعل  
40/ 5 – محمد      40/ 6 – عمرو 
39/ 4 – علي بن عبد اللطيف بن محسن 
وأعقب : 
40/ 1 – محمد  40/ 2 – مصطفى   
40/ 3 – ماجد    40/ 4 – أمجد      
 
أعقاب= 
عبد الله بن عبد الخبير بن محسن بن علي بن عبد الله بن علي  بن جيلان بن عبَّاد 
وأعقب : 
40/ 1 – عبد الرحمن     40 / 2 – جواد    40/ 3 – فارس             40/ 4 – مالك       
40/ 5 – محمد  40/ 6 – هيثم 
40/ 1 – عبد الرحمن بن عبد الله بن عبد الخبير 
وأعقب : 
41/ 1 – أنيس   41/ 2 – 

أعقاب= 
عبد الولي بن علي بن عبد الله بن علي بن جيلان بن عبَّاد 

وأعقب : 
38/ 1 – مهيوب واعقب بنتا ،  ولم يعقب  من الذكور 

أعقاب= 
جيلان بن  حيدر بن عبد الله بن علي  بن جيلان بن عبًّاد 

وأعقب : 
39/ 1 – إسماعيل بن عبد الله بن جيلان بن  حيدر 
وأعقب : 
40/ 1 – سعيد 40/ 2 – يحي  
38/ 2 – احمد بن جيلان بن حيدر 
وأعقب : 
39/ 1 – عبد الوهاب 39/ 2 – إسماعيل 

اعقاب =  
محسن عبد الله بن عبَّاد 
وأعقب :
34/ 1 –  

        أعقاب = 
32/ 2 - عطاء بن محسن بن أحمد الجنيد بن محمد جمال الدين بن عبد الرحمن النقل بن أحمد بن عبد الله الحضرمي 
أعقاب=
سيف بن غالب بن فاضل بن يحي بن محمد بن عطاء  
38/ 1 - سعيد بن سيف بن غالب 
39/ 1 – أحمد بن سعيد بن سيف بن غالب 
وأعقب :
40/ 1 –  خالد 40/ 2 – فؤاد 
40/ 3 – عادل 40/ 4 – عصام  
40/ 1 –  خالد بن أحمد بن سعيد بن سيف بن غالب  
وأعقب :
41/ 1 –  محمد 
39/ 2 – عبد الله بن سعيد بن سيف بن غالب   
وأعقب :
40/ 1 –  محمد 
39/ 3 – محمد بن سعيد بن سيف بن غالب 
وأعقب :
40/ 1 –  سيف 40/ 2 – حسين  
40/ 3 – 
39/ 4 - :علي بن سعيد بن سيف ( لم يعقب)
39/ 5 - عبد الوهاب بن سعيد بن سيف
وأعقب:
40/ 1 - 
38/ 2 – حسن بن سيف بن غالب 
وأعقب :
39/ 1 –  محمد 39/ 2 – أحمد             
أعقاب=
أحمد بن عبد الكريم بن محسن بن أنعم بن حسان بن محمد بن عطاء  
وأعقب :
39/ 1 – إبراهيم     39/ 2 – أحمد 
39/ 3 -               
39/ 1 – إبراهيم بن أحمد بن عبد الكريم 
وأعقب :
40/ 1 – محمد     40/ 2 – أمين 
40/ 3 - عبد الله            40/ 4 - نجيب 
40/ 5 – عمر        40/ 6 – ضياء 
40/ 7 – عبد الرحمن 
40/ 1 –  محمد بن إبراهيم بن أحمد بن عبد الكريم 
وأعقب :
41/ 1 –  أحمد 41/ 2 –
40/ 2 – أمين بن إبراهيم بن أحمد بن عبد الكريم    
وأعقب :
41/ 1 – أنور 41/ 2 – ضياء
41/ 3 - مروان 41/ 4 - 
40/ 3 - عبد الله بن إبراهيم بن أحمد بن عبد الكريم 
وأعقب :
41/ 1 –  ضياء 
   
40/ 4 - نجيب بن إبراهيم بن أحمد بن عبد الكريم 
وأعقب :
41/ 1 –  
39/ 2 – أحمد بن أحمد بن عبد الكريم 
وأعقب:
40/ 1 – عبد الرحمن     40/ 2 – عبد الغني 
40/ 3 - مفضل                  40/ 4 - محمد 
40/ 5 – سامي 
40/ 1 – عبد الرحمن بن احمد بن احمد بن عبد الكريم 
وأعقب :
41/ 1 –  

       أعقاب=
عبد الوهاب بن محمد بن علي بن محمد بن محمد بن حسان بن محمد بن عطاء  
وأعقب :
40/ 1 –  محمد 40/ 2 – فؤاد  
40/ 1 –  محمد بن عبد الوهاب 
وأعقب :
41/ 1 –  حسام 41/ 2 – بسام 
41/ 3 - سيف 41/ 4 - حسان 
41/ 5 – محمد 

40/ 2 – فؤاد بن عبد الوهاب 
وأعقب :
41/ 1 – تركي 
39/ 2 – سعيد بن محمد بن علي بن محمد بن محمد بن حسان بن محمد بن عطاء  
وأعقب :
40/ 1 –  محمد متوفى ولا عقب له 
40/ 2 – حاتم 39 / 3 – عمر 
40/ 2 – حاتم بن سعيد بن محمد  
وأعقب :
41/ 1 –  سيف 
40/ 3 – عمر بن سعيد بن محمد  
وأعقب :
41/ 1 – محمد   40 / 2 – علي 

34/ 3 – إبراهيم بن محمد بن عطاء بن محسن بن أحمد الجنيد بن محمد جمال الدين  
وأعقب :
35/ 1 – راجح 35/ 2 – محسن 
38/ 1 – محمد بن عبد الله بن سيف بن راجح بن إبراهيم بن محمد بن عطاء  
وأعقب :
38/ 1 – عقيل مات و لا عقب له   38/ 2 – محمد
38/ 3 - سامي 38/ 4 - عبد الرحمن 
36/ 2 – سعيد بن راجح بن إبراهيم بن محمد بن عطاء   
وأعقب :
37/ 1 – عبد الله  36 / 2 – محمد 
37/ 1 – عبد الله بن سعيد بن راجح بن إبراهيم بن محمد بن عطاء   
وأعقب :
38/ 1 – حسن 38/ 2 – عبد الكريم 
38/ 3 -  سعيد 
38/ 1 –  حسن بن عبد الله بن سعيد بن راجح 
وأعقب :
39/ 1 – عبد الله 39/ 2 – أحمد 
39/ 3 -  سعيد 
39/ 1 – عبد الله بن حسن بن عبد الله بن سعيد بن راجح 
وأعقب :
40/ 1 – عادل 40/ 2 – شكري 
40/ 3 – هيثم  40/ 4 - معتوق 
39/ 2 – أحمد بن حسن بن عبد الله بن سعيد بن راجح 
وأعقب :
40/ 1 – مهيوب 40/ 2 – الجنيد  
40/ 3 – عبد الرحمن   
39/ 3 - سعيد بن حسن بن عبد الله بن سعيد بن راجح 
وأعقب :
40/ 1 – محمد 40/ 2 – عمر   
38/ 2 – عبد الكريم بن عبد الله بن سعيد بن راجح 
وأعقب :
39/ 1 – عبد الرحمن 39/ 2 – إبراهيم 
39/ 3 - أحمد        39/ 4 - عبد الخالق
39/ 5 – شمسان ( مات ولا عقب له ) 
39/ 1 – عبد الرحمن بن عبد الكريم بن عبد الله بن سعيد بن راجح 
وأعقب :
40/ 1 – أحمد متوفى 40/ 2 – زكريا
40/ 3 - أسامة      40/ 4 - إسحاق
40/ 5 – يعقوب  
39/ 2 – إبراهيم بن عبد الكريم بن عبد الله بن سعيد بن راجح 
وأعقب :
40/ 1 – محمد 40/ 2 – ماهر 
40/ 3 - عدنان   40/ 4 - بليغ 
40/ 5 – متعب 
39/ 3 - أحمد بن عبد الكريم بن عبد الله بن سعيد بن راجح 
وأعقب :
40/ 1 – الجنيد 40/ 2 – هيثم 
40/ 3 – موسى  

39/ 4 - عبد الخالق بن عبد الكريم بن عبد الله بن سعيد بن راجح 
وأعقب :
40/ 1 – جمال 40/ 2 – محمد 
38/ 3 -  سعيد بن عبد الله بن سعيد بن راجح 
وأعقب :
39/ 1 – عبد الوهاب 
39/ 1 –  عبد الوهاب بن سعيد بن عبد الله بن سعيد بن راجح  
وأعقب :
40/ 1 – محمود 40/ 2 – عبد العزيز 
40/ 3 - محمد    40/ 4 - عدنان  
40/ 5 – زكريا 
40/ 1 –  محمود بن عبد الوهاب بن سعيد بن عبد الله بن سعيد بن راجح   
وأعقب :
41/ 1 – محمد 41/ 2 – عدنان 

40/ 2 – عبد العزيز بن عبد الوهاب بن سعيد بن عبد الله بن سعيد بن راجح  
وأعقب :
41/ 1 –  41/ 2 –
40/ 3 -  محمد بن عبد الوهاب بن سعيد بن عبد الله بن سعيد بن راجح  
وأعقب :
41/ 1 – سعيد 41/ 2 – 
40/ 4 - عدنان بن عبد الوهاب بن سعيد بن عبد الله بن سعيد بن راجح  
وأعقب :
41/ 1 –  41/ 2 – 
40/ 5 – زكريا بن عبد الوهاب بن سعيد بن عبد الله بن سعيد بن راجح  
وأعقب :
41/ 1 –  41/ 2 – 

37/ 2 – محمد بن سعيد بن راجح  
وأعقب :
38/ 1 –  عبد الله 
38/ 1 – عبد الله بن محمد بن سعيد بن راجح  
وأعقب :
39/ 1 – محمد 
39/ 1 – محمد بن عبد الله بن محمد بن سعيد بن راجح 
وأعقب :
40/ 1 – عبد الرحمن 40/ 2 – صادق 
40/ 1 – عبد الرحمن بن محمد بن عبد الله بن محمد بن سعيد بن راجح  
وأعقب :
41/ 1 – أحمد 
40/ 2 – صادق بن محمد بن عبد الله بن محمد بن سعيد بن راجح  
وأعقب :
41/ 1 – علوي 41/ 2 – زكريا  
36/ 3 - مهيوب بن راجح بن ابراهيم بن محمد بن عطاء
وأعقب:  
37/ 1 – سعيد 37/ 2 – محمد 
37/ 1 – سعيد بن مهيوب بن راجح  
وأعقب :
38/ 1 – معاذ 38/ 2 – محمد
38/ 3 - مختار 

37/ 2 – محمد بن بن مهيوب بن راجح   
وأعقب :
38/ 1 – أمين 38/ 2 – النونو 
38/ 3 – أحمد  
38/ 1 – أمين بن محمد بن بن مهيوب بن راجح   
وأعقب :
39/ 1 – راجح  39/ 2 – أحمد 

38/ 2 – النونو بن محمد بن بن مهيوب بن راجح   
وأعقب :
39/ 1 –  39/ 2 – 
38/ 3 – أحمد بن محمد بن مهيوب بن راجح   
وأعقب :
39/ 1 –  39/ 2 –
37/ 1 – حمادي بن أحمد بن راجح  
وأعقب :
38/ 1 – محمد  38/ 2 – عبد الكريم 
37/ 1 – محمد بن حمادي  بن أحمد بن راجح 
وأعقب :
38/ 1 – أمين 38/ 2 – مصطفى
38/ 3 - يوسف 38/ 4 - وليد   
38/ 5 – مراد   38/ 6 – عبد الهادي 
38/ 1 – أمين بن محمد بن حمادي بن أحمد بن راجح 
وأعقب :
39/ 1 – سعيد 39/ 2 – مصطفى

39/ 2 – مصطفى بن محمد بن حمادي بن أحمد بن راجح 
وأعقب :
40/ 1 – عقلان 
39/ 3 - يوسف بن محمد بن حمادي بن أحمد  بن راجح 
وأعقب :
40/ 1 – عبد الحكيم 40/ 2 – مروان 
  
38/ 2 – عبد الكريم بن حمادي بن أحمد  بن راجح   
وأعقب :
39/ 1 –  عفيف متوفى 39/ 2 – رياض
39/ 3 – وسيم        39/ 4 - أكرم 
أعقاب شارح البحر:

      أعفاب=
محسن بن إبراهيم بن محمد بن عطاء  بن محسن بن أحمد بن محمد جمال الدين الجنيد 
وأعقب :
35/ 1 –  35/ 2 –
35/ 3 -     35/ 4 - 

            أعقاب=
جيلان بن محمد بن عطاء بن محسن بن أحمد الجنيد بن محمد جمال الدين  
وأعقب :
35/ 1 –  

أعقاب=
علوان بن عطاء بن محسن بن أحمد الجنيد بن محمد جمال الدين  
وأعقب :
38/ 1 – عبد الواسع بن عبد الغني بن حيدر بن سعيد بن يحيى بن علوان بن عطاء  
وأعقب :
39/ 1 – مقبل    39/ 2 – مهيوب 
39/ 3 - حسن      39/ 4 - محمد 
39/ 5 – أحمد 
39/ 1 – مقبل بن عبد الواسع 
وأعقب :
40/ 1 – أمين      40/ 2 – عبد العزيز 40/ 3 – محمد   
40/ 1 – أمين بن مقبل بن عبد الواسع 
وأعقب :
41/ 1 –  41/ 2 –
41/ 3 -  41/ 4 - 

40/ 2 – عبد العزيز بن مقبل بن عبد الواسع 
وأعقب :
41/ 1 – نايف 41/ 2 –
41/ 3 -           41/ 4 -
40/ 3 – محمد بن مقبل بن عبد الواسع 
وأعقب :
41/ 1 –  41/ 2 –
41/ 3 -     41/ 4 -  

39/ 2 – مهيوب بن عبد الواسع بن عبد الغني بن حيدر بن سعيد بن يحي بن علوان بن عطاء   
وأعقب :
40/ 1 – سعيد  40/ 2 –
40/ 1 – سعيد بن مهيوب بن عبد الواسع 
وأعقب :
41/ 1 –  محمود 41/ 2 – رضوان 
41/ 3 – عدنان    41/ 4 - أسامة  
41/ 5 – صلاح     41/ 6 – مختار 
41/ 7 – محمد 
39/ 3 -  حسن بن عبد الواسع 
وأعقب :
40/ 1 – محمد 
40/ 1 –  محمد بن حسن بن عبد الواسع 
وأعقب :
41/ 1 – جمال  41/ 2 – هيثم 
39/ 4 - محمد بن عبد الواسع 
وأعقب :
40/ 1 –  محمد 
40/ 1 –  محمد بن محمد بن عبد الواسع 
وأعقب :
41/ 1 – عبد العزيز   41/ 2 – خالد 
41/ 3 - عمار         41/ 4 - يعقوب 
41/ 5 – عيسى   
39/ 5 – أحمد بن عبد الواسع 
وأعقب :
40/ 1 – أمين  40/ 2 – محمد 39 / 3 -  
40/ 1 – أمين بن أحمد بن عبد الواسع 
وأعقب :
41/ 1 –  41/ 2 –
41/ 3 -     41/ 4 -  
40/ 2 – محمد بن أحمد بن عبد الواسع 
وأعقب :
41/ 1 –  41/ 2 –
41/ 3 -     41/ 4 -  

        أعقاب=
فاضل بن أحمد الجنيد بن محمد جمال الدين [ قدس ]
لم يتم موافاتنا

      أعفاب=
رضوان بن أحمد الجنيد بن محمد جمال الدين [ الحشاء والضالع ] ولم يتم موافاتنا بأي معلوما]
  
      أعقاب=
عمر بن أحمد الجنيد بن محمد جمال الدين
[ الحشاء والضالع] ولم يتم موافاتنا بأي معلومات باستثناء عمود نسب الشيخ صالح وفواز الجنيد وكما يلي :
______
      أعقاب=
قاسم بن صالح بن مثنى بن قاسم بن صالح بن حسن بن عبد الله بن صالح بن رضوان بن أحمد بن عمر بن أحمد الجنيد بن محمد جمال الدين 
وأعقب : 
42/ 1- أحمد 42/ 2 – عبد الله 
42/ 3 – صالح 42/ 4 - 
42/ 1 – أحمد بن قاسم بن صالح بن مثنى 
وأعقب : 
43/ 1 – 43/ 2 – 
43/ 3 – 43/ 4 – 
ـــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــ
42/ 2 – عبد الله بن قاسم بن صالح بن مثنى  
وأعقب : 
43/ 1 – 43/ 2 – 
43/ 3 – 43/ 4 – 
ــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــ
42/ 3 – صالح بن قاسم بن صالح بن مثنى  
وأعقب : 
43/ 1 – 43/ 2 – 
43/ 3 – 43/ 4 – 
___
        أعقاب=
عبده بن حسن بن محمد بن صلاح بن علي بن مقبل بن عبد الله بن صالح بن رضوان بن أحمد بن عمر بن أحمد الجنيد بن محمد جمال الدين 
وأعقب : 
42/ 1- فواز 42/ 2 – عمار  
42/ 3 – صلاح 42/ 4 - فهد (شهيد) لا عقب له 
42/ 1 – فواز بن عبده بن حسن 
وأعقب : 
43/ 1 –هاشم 
42/ 2 – عمار بن عبده بن حسن 
وأعقب : 
43/ 1 – علاء الدين 43/ 2 –لقمان 
42/ 3 – صلاح بن عبده بن حسن 
وأعقب : 
43/ 1 –فهد 
          أعقاب = 
عبد الله بن أحمد الجنيد بن محمد جمال الدين[ الضالع والحشاء وقدس ] ولم يتم موافاتنا بأي معلومات
""")
print("Part 3 written")
