with open('source_lineage.txt', 'a', encoding='utf-8') as f:
    f.write("""
أعقاب / 
عبد الواحد بن عبد الله بن أحمد بن عثمان بن محمد بن محمد بن إبراهيم بن عبد الرحمن الجنيد 
وأعقب: 
37/ 1 – عبد الواحد       37/ 2 - عبد اللطيف
37/ 3 - عبد الحميد
____>>
37/ 1 – عبد الواحد بن عبد الله بن أحمد بن عثمان  
وأعقب: 
38/ 1 – سيف       38/ 2 – عبد المجيد 
38/ 3 – عبد الإله 38/ 4 – عبد الله ( × )
38/ 4 - علي (×)
____
38/ 1 – سيف بن عبد الواحد بن عبد الله بن أحمد بن عثمان 
وأعقب : 
39/ 1 – سعيد   39/ 2 – محمد
39/ 3 -عبد الغني   39/ 3 - عبد الكريم (×)   
____
39/ 1 – سعيد بن  سيف بن عبد الواحد بن عبد الله بن أحمد بن عثمان 
وأعقب: 
40/ 1 – محمد         40/ 2 – عبد الله
40/ 3 – عبد السلام 
40/ 1 – محمد بن سعيد بن  سيف 
وأعقب: 
41/ 1 – محمد            41/ 2 – العيدروس
41/ 3 -
____
40/ 2 – عبد الله بن سعيد بن  سيف 
وأعقب: 
41/ 1 – بسام (شهيد) 41/ 2 –  
__
40/ 3 – عبد السلام بن سعيد بن  سيف 
وأعقب: 
41/ 1 –            41/ 2 – 
____
 
39/ 2 –  محمد بن  سيف بن عبد الواحد 
وأعقب :  
40/ 1 – مصطفى(×) 40/ 2 – عبد الرحمن 40/ 3 – عبد الحكيم 
40/ 1 – عبد الرحمن بن محمد بن  سيف بن عبد الواحد
وأعقب: 
41/ 1 – أحمد 41/ 2 – محمد 
__
40/ 1 – عبد الحكيم بن محمد بن  سيف بن عبد الواحد
وأعقب: 
41/ 1 – أحمد 41/ 2 – جوهر 
__
39/ 2 - عبد الغني بن  سيف بن عبد الواحد 
وأعقب: 
40/ 1 – أمين       40/ 2 – محمد 
40/ 3 - محمود

40/ 1 – أمين بن عبد الغني بن سيف 
وأعقب: 
41/ 1 – عبد الغني
40/ 1 – محمد بن عبد الغني بن سيف 
وأعقب: 
41/ 1 – عبد الغني
============/==
38/ 2 – عبد المجيد بن عبد الواحد بن عبد الله بن أحمد بن عثمان 
وأعقب : 
39/ 1 – سعيد ( × ) 39/ 2 – أحمد
39/ 3 –  حسن 
39/ 2 – أحمد بن  عبد المجيد بن عبد الواحد بن عبد الله بن أحمد بن عثمان 
وأعقب: 
40/ 1 – محمد  40/ 2 – سعيد  
____
40/ 1 – محمد بن أحمد بن عبد المجيد 
وأعقب: 
41/ 1 – عبد العزيز           41/ 2 – محمد
41/ 3 – عبد الرحمن
__
41/ 1 – عبد العزيز بن محمد بن أحمد بن  عبد المجيد وأعقب: 
42/ 1 – معتز 42/ 2 –  42/ 3 –  
__
41/ 2 – محمد بن محمد بن أحمد بن  عبد المجيد 
وأعقب: 
42/ 1 –             42/ 2 – 42/ 3 – 
__
40/ 2 – سعيد بن أحمد بن  عبد المجيد 
وأعقب: 
41/ 1 – محمد 41/ 2 – نبيل 41/ 3 – فؤاد  41/ 4 – أمين  
_
41/ 1 – محمد بن سعيد بن أحمد بن  عبد المجيد 
وأعقب: 
42/ 1 – 42/ 2 – 42/ 3 –  
//_//_//___//
39/ 3 – حسن بن  عبد المجيد بن عبد الواحد بن عبد الله بن أحمد بن عثمان 
وأعقب: 
40/ 1 – عبد الكريم         40/ 2 – عبده  
40/ 3 – عبد الوهاب       40/ 2 – محمد   
40/ 1 – عبد الكريم  بن حسن بن  عبد المجيد 
وأعقب: 
41/ 1 – عبد الله 41/ 2 – محمد
41/ 3 – فؤاد  
41/ 1 – عبد الله بن عبد الكريم  بن حسن  
وأعقب : 
42/ 1 – جميل        42/ 2 – معمر 
42/ 3 –                     42/ 4 –
42/ 5 –                     42/ 6 –
42/ 7 –                     42/ 8 –
__
41/ 2 – محمد بن عبد الكريم  بن حسن 
وأعقب: 
42/ 1 –         42/ 2 –
42/ 3 –         42/ 4 –
42/ 5 –
_____
41/ 3 – فؤاد بن عبد الكريم بن حسن 
وأعقب: 
42/ 1 – 42/ 2 – 42/ 3 –
//___//____>_//
40/ 2 – عبده بن حسن بن عبد المجيد 
وأعقب: 
41/ 1 – 41/ 2 – 41/ 3 –  
//___//__//__// 
 40/ 3 – عبد الوهاب بن حسن بن  عبد المجيد 
وأعقب: 
41/ 1 – 41/ 2 – 41/ 3 – 
40/ 4 – محمد بن حسن بن عبد المجيد 
وأعقب: 
41/ 1 – إبراهيم 41/ 2 – عبد الرحمن 41/ 3 – 
___//_//_// 
38/ 3 – عبد الإله بن عبد الواحد بن عبد الله بن أحمد بن عثمان 
وأعقب:  
39/ 1 – 39/ 2 –  39/ 3- 39/ 4-  
39/ 1 –بن  عبد الإله بن عبد الواحد بن عبد الله بن أحمد بن عثمان بن محمد بن محمد بن إبراهيم بن عبد الرحمن الجنيد 
وأعقب :  
40/ 1 – 40/ 2 – 40/ 3 –  
41/ 1 –بن بن  عبد الإله بن عبد الواحد بن عبد الله بن أحمد بن عثمان بن محمد بن محمد بن إبراهيم بن عبد الرحمن الجنيد 
وأعقب :  
42/ 1 – 42/ 2 –  
ـــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــ
أعقاب شارح البحر:
أعقاب / 
عثمان بن أحمد بن عثمان بن محمد بن محمد بن إبراهيم بن عبد الرحمن الجنيد 
36/ 5 –  عثمان بن أحمد بن عثمان بن محمد بن محمد بن إبراهيم بن عبد الرحمن الجنيد 
وأعقب :  
37/ 1 – أحمد 36 / 2 –  
37/ 1 – أحمد بن عثمان بن أحمد بن عثمان بن محمد بن محمد بن إبراهيم بن عبد الرحمن الجنيد  
وأعقب :  
38/ 1 – سرور 38/ 2 – عبد الكريم 
38/ 3- يحي     38/ 4 -أحمد  (×) 
38/ 1 – سرور بن أحمد بن عثمان بن أحمد بن عثمان بن محمد بن محمد بن إبراهيم بن عبد الرحمن الجنيد  
وأعقب :  
39/ 1 – عبد الله 39/ 2 –  أحمد
39/ 3 - عبد الوهاب   
39/ 1 – عبد الله بن  سرور بن أحمد بن عثمان بن أحمد بن عثمان بن محمد بن محمد بن إبراهيم بن عبد الرحمن الجنيد 
وأعقب :  
40/ 1 – إبراهيم     40/ 2 – أمين     
40/ 3 – رشاد-1 ( × ) 40/ 4 – فؤاد 
40/ 5 – عدنان     40/ 6 – الجنيد     
40/ 7 – رشاد - الثاني 40/ 8 – محمد
40/ 1 – إبراهيم بن عبد الله بن  سرور بن أحمد بن عثمان بن أحمد بن عثمان بن محمد بن محمد بن إبراهيم بن عبد الرحمن الجنيد 
وأعقب :  
41/ 1 – عبد الرحمن 41/ 2 – فواز 
41/ 3 – فؤاد 41/ 4 – محمد 41/ 5 – عمر
41/ 6 – أمين 41/ 7 – علي 
41/ 1 – عبد الرحمن بن ابراهيم بن عبد الله بن  سرور بن أحمد بن عثمان بن أحمد بن عثمان بن محمد بن محمد بن إبراهيم بن عبد الرحمن الجنيد 
وأعقب :  
42/ 1 – السجاد 42/ 2 –  
40/ 2 – أمين بن عبد الله بن  سرور بن أحمد بن عثمان بن أحمد بن عثمان بن محمد بن محمد بن إبراهيم بن عبد الرحمن الجنيد 
وأعقب :  
41/ 1 – عمار 41/ 2 – عمرو   
41/ 3 – محمد     41/ 4 – منذر    41/ 5 – لؤي  
40/ 3 – فؤاد بن عبد الله بن  سرور أحمد بن عثمان بن أحمد بن عثمان بن محمد بن محمد بن إبراهيم بن عبد الرحمن الجنيد 
وأعقب :  
41/ 1 – محمد 41/ 2 – المتوكل   
39/ 2 – أحمد بن  سرور بن أحمد بن عثمان بن أحمد بن عثمان بن محمد بن محمد بن إبراهيم بن عبد الرحمن الجنيد 
وأعقب :  
40/ 1 – عبد الملك 40/ 2 – فضل 
40/ 3 – معاذ   
40/ 3 – عبد الملك بن أحمد بن  سرور بن أحمد بن عثمان بن أحمد بن عثمان بن محمد بن محمد بن إبراهيم بن عبد الرحمن الجنيد 
وأعقب :  
41/ 1 – عبد الله  41/ 2 – أحمد     
40/ 3 – فضل بن أحمد بن  سرور بن أحمد بن عثمان بن أحمد بن عثمان بن محمد بن محمد بن إبراهيم بن عبد الرحمن الجنيد 
وأعقب :  
41/ 1 – أحمد  41/ 2 – محمد     
40/ 3 – معاذ بن أحمد بن  سرور بن أحمد بن عثمان بن أحمد بن عثمان بن محمد بن محمد بن إبراهيم بن عبد الرحمن الجنيد 
وأعقب :  
41/ 1 – أحمد  41/ 2 – 
39/ 3 – عبد الوهاب بن  سرور بن أحمد بن عثمان بن أحمد بن عثمان بن محمد بن محمد بن إبراهيم بن عبد الرحمن الجنيد 
وأعقب :  
40/ 1 – محمد 40/ 2 – علي 
40/ 3 – عبد القوي 40/ 4 – السقاف 
40/ 5 – عمر 40/ 6 – علوي 
40/ 7 – حسن     40/ 8 – زيد 
ــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــ 
38/ 1 – عبد الكريم بن أحمد بن عثمان بن أحمد بن عثمان بن محمد بن محمد بن إبراهيم بن عبد الرحمن الجنيد  
وأعقب :  
39/ 1 – عبد الغني 39/ 2 –  عبد الرقيب
39/ 3 - عبد الوهاب  39/ 1 – عبد الباري 
39/ 1 – عبد الغني بن عبد الكريم بن أحمد بن عثمان بن أحمد بن عثمان بن محمد بن محمد بن إبراهيم بن عبد الرحمن الجنيد 
وأعقب :  
40/ 1 – عبد الرؤوف 40/ 2 – نبيل 
40/ 3 – عبد الحكيم 40/ 4 – أكرم    
40/ 5 – مختار 40/ 6 – بسام 
40/ 7 – عمر 40/ 8 – صلاح    
40/ 9 – اسامة 40/ 10 – محمد    
40/ 1 – عبد الرؤوف بن عبد الغني بن عبد الكريم بن أحمد بن عثمان بن أحمد بن عثمان بن محمد بن محمد بن إبراهيم بن عبد الرحمن الجنيد 
وأعقب :  
41/ 1 – محمد 41/ 2 – أحمد 
41/ 3 –  
40/ 2 – نبيل بن عبد الغني بن عبد الكريم بن أحمد بن عثمان بن أحمد بن عثمان بن محمد بن محمد بن إبراهيم بن عبد الرحمن الجنيد 
وأعقب :  
41/ 1 – محمد   
40/ 3 – عبد الحكيم بن عبد الغني بن عبد الكريم بن أحمد بن عثمان بن أحمد بن عثمان بن محمد بن محمد بن إبراهيم بن عبد الرحمن الجنيد 
وأعقب :  
41/ 1 –  
40/ 4 – أكرم بن عبد الغني بن عبد الكريم بن أحمد بن عثمان بن أحمد بن عثمان بن محمد بن محمد بن إبراهيم بن عبد الرحمن الجنيد 
وأعقب :  
41/ 1 – عبد الكريم  
39/ 2 –  عبد الرقيب بن عبد الكريم بن أحمد بن عثمان بن أحمد بن عثمان بن محمد بن محمد بن إبراهيم بن عبد الرحمن الجنيد 
وأعقب :  

40/ 1 – رفيق 40/ 2 – طاهر 
40/ 3 – حمزة   
40/ 1 – رفيق بن عبد الرقيب بن عبد الكريم بن أحمد بن عثمان بن أحمد بن عثمان بن محمد بن محمد بن إبراهيم بن عبد الرحمن الجنيد 
وأعقب :  
41/ 1 – محمد   
39/ 3- عبد الوهاب بن عبد الكريم بن أحمد بن عثمان بن أحمد بن عثمان بن محمد بن محمد بن إبراهيم بن عبد الرحمن الجنيد 
 وأعقب :  
40/ 1 – محمد 40/ 2 – عبد الكريم 
40/ 3 – الامام   
39/ 1 – عبد الباري بن عبد الكريم بن أحمد بن عثمان بن أحمد بن عثمان بن محمد بن محمد بن إبراهيم بن عبد الرحمن الجنيد 
وأعقب :  
40/ 1 – فتح 40/ 2 – عبد الوهاب 
40/ 3 – بدر   
ــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــ 
38/ 1 – يحي  بن أحمد بن عثمان بن أحمد بن عثمان بن محمد بن محمد بن إبراهيم بن عبد الرحمن الجنيد  
وأعقب :  
39/ 1 – عبد الواسع  
39/ 1 – عبد الواسع بن يحي  بن أحمد بن عثمان بن أحمد بن عثمان بن محمد بن محمد بن إبراهيم بن عبد الرحمن الجنيد 
وأعقب :  
40/ 1 – أمين 40/ 2 –  محمد  
40/ 1 – أمين بن عبد الواسع بن يحي  بن أحمد بن عثمان بن أحمد بن عثمان بن محمد بن محمد بن إبراهيم بن عبد الرحمن الجنيد 
وأعقب :  
41/ 1 – محمد 41/ 2 –  نادر  
40/ 2 –  محمد بن عبد الواسع بن يحي بن أحمد بن عثمان بن أحمد بن عثمان بن محمد بن محمد بن إبراهيم بن عبد الرحمن الجنيد 
وأعقب :  
41/ 1 – أحمد 41/ 2 –  إبراهيم  
41/ 3 – أمين 41/ 4 –  جمال    
ــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــ

@@@@@@@@@@@@
                أعقاب / 
فضل بن أحمد بن عثمان بن محمد بن محمد بن إبراهيم بن عبد الرحمن الجنيد 
36/ 7 -  فضل بن أحمد بن عثمان بن محمد بن محمد بن إبراهيم بن عبد الرحمن الجنيد 
وأعقب :  
37/ 1 –  محمد 37/ 2 – عبد الرحمن 
37/ 1 – محمد بن فضل بن أحمد بن عثمان بن محمد بن محمد بن إبراهيم بن عبد الرحمن الجنيد  
وأعقب :  
38/ 1 – عبد الشافي 38/ 2 – 38/ 3 - 
38/ 1 – عبد الشافي بن محمد بن فضل بن أحمد بن عثمان  
وأعقب :  
39/ 1 – عبد القوي 39/ 2  –  39/ 3 -  
39/ 1 – عبد القوي بن عبد الشافي بن محمد بن فضل بن أحمد بن عثمان 
وأعقب :  
40/ 1 – محمد     40/ 2 – ماجد     
40/ 3 – غمدان 40/ 4 – معاذ 40/ 5 –      
40/ 1 – محمد بن عبد القوي بن عبد الشافي بن محمد بن فضل بن أحمد بن عثمان 
  وأعقب :  
41/ 1 – 41/ 2 – 
 40/ 2 – ماجد بن عبد القوي بن عبد الشافي بن محمد بن فضل بن أحمد بن عثمان 
وأعقب :  
41/ 1 –   41/ 2 –
37/ 2 –عبد الرحمن بن  فضل بن أحمد بن عثمان 
وأعقب :  
38/ 1 –  محمد  38/ 2 –  37/ 3-  
38/ 1 –  محمد بن عبد الرحمن بن فضل بن أحمد بن عثمان 
وأعقب :  
39/ 1 – إبراهيم      39/ 2 – 39/ 3 –       
39/ 1 – إبراهيم بن محمد  بن عبد الرحمن بن محمد بن فضل بن أحمد بن عثمان 
  وأعقب :  
40/ 1 –عباس   40/ 2 –عبد الرحمن     
40/ 3 – أحمد   40/ 4 – عبد الملك 
40/ 1 –عباس بن إبراهيم  بن محمد  بن عبد الرحمن بن محمد بن فضل بن أحمد بن عثمان  
وأعقب :  
41/ 1 – 41/ 2 –  
40/ 2 – عبد الرحمن بن إبراهيم  بن محمد  بن عبد الرحمن بن محمد بن فضل بن أحمد بن عثمان    
وأعقب :  
41/ 1 – 41/ 2 –  
40/ 3 – أحمد بن إبراهيم  بن محمد  بن عبد الرحمن بن محمد بن فضل بن أحمد بن عثمان  
وأعقب :  
41/ 1 – 41/ 2 –  
 40/ 4 – عبد الملك بن إبراهيم  بن محمد  بن عبد الرحمن بن محمد بن فضل بن أحمد بن عثمان 
وأعقب :  
41/ 1 – 41/ 2 –  
ــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــ
""")
print("Part 7 written")
