with open('source_lineage.txt', 'a', encoding='utf-8') as f:
    f.write("""
الفرع الثاني//
34/ 2 – الهزبر بن الحسين بن محمد بن إبراهيم بن عبد الرحمن الجنيد
وأعقب: 
35/ 1 –  عبد القادر          2/35 - عبدالله(× ) 
3/35 - عقلان (×) 
35/ 1 – عبد القادر بن هزبر بن الحسين بن محمد    إبراهيم بن عبد الرحمن الجنيد
وأعقب:
36/ 1 – محمد 36/ 2 – عبدالصمد 
 
36/ 1 – محمد بن عبد القادر بن الهزبر بن الحسين بن إبراهيم بن عبد الرحمن الجنيد
وأعقب:
37/ 1 – إبراهيم 2/37- محمد 
3/37 - يحيى (×) 
37/ 1 – إبراهيم بن محمد بن عبد القادر بن محمد بن الهزبر 
وأعقب: 
38/ 1 – أحمد         38/ 2 – عبد الجليل 
38/ 3 – عبد الرحمن          4/38 - محمد(×) 
38/ 1 – أحمد بن إبراهيم بن محمد بن عبد القادر بن الهزبر 
وأعقب:
39/ 1 – عبد الصمد      39/ 2 – عبد القادر 
39/ 3 – عبد الغني      39/ 4 – سلطان 
39/ 5 – عبد الرحمن    
39/ 1 – عبد الصمد بن أحمد بن إبراهيم بن محمد بن عبد القادر بن الهزبر 
وأعقب: 
40/ 1 – حسين       40/ 2 –خليل 
40/ 3 – طه                   
1/40 حسين بن عبدالصمد بن أحمد بن إبراهيم بن محمد بن عبدالقادر بن الهزبر
واعقب:  
1/41 محمد 
2/40 ـ خليل عبد الصمد بن أحمد بن إبراهيم بن محمد بن عبد القادر بن الهزبر
واعقب: 
1/41 عبدالصمد          2/41 ــ محمد  

3/40 ــ طه عبد الصمد بن أحمد بن إبراهيم بن محمد بن عبدالقادر بن الهزبر 
واعقب: 
1/41 ــ محمد            2/41 ــ الهزبر 
39/ 2 – عبد القادر بن أحمد بن إبراهيم بن محمد بن عبد القادر بن الهزبر 
وأعقب:
40/ 1 – عبد الهادي ( شهيد ) 40/ 2 –
   
39/ 3 – عبد الغني بن أحمد بن إبراهيم بن محمد بن عبد القادر بن الهزبر 
وأعقب: 
40/ 1 – بشار     
39/ 4 – سلطان بن أحمد بن إبراهيم بن محمد بن عبد القادر بن الهزبر 
وأعقب:
40/ 1 – هزبر(شهيد)        40/ 2 – نذير
40/ 3 – مطهر                     40/ 4 – احمد 
1/40 ــ هزبر بن سلطان بن احمد بن ابراهيم بن محمد بن عبدالقادر بن الهزبر 
واعقب: 
1/41- هادي 
39/ 5 – عبد الرحمن بن أحمد بن إبراهيم بن محمد بن عبد القادر بن الهزبر 
وأعقب : 
40/ 1 – عصام      40/ 2 – أبوطالب 
40/ 3 – حمزة       
2/40 ــ أبوطالب بن عبدالرحمن بن أحمد بن إبراهيم بن محمد بن عبد القادر بن الهزبر 
واعقب: 
1/41 ــ علي 
ـــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــ 
38/ 2 – عبد الجليل بن  إبراهيم بن محمد بن عبد القادر بن الهزبر 
وأعقب: 
39/ 1 – عبد العزيز          39/ 2 – محمد
39/ 3 – عبد الرزاق          39/ 4 – أحمد 
5/39 -- مختار
1/39--عبد العزيز بن عبد الجليل بن ابراهيم بن محمدبن عبد القادر بن الهزبر  
واعقب: 
1/40-- إدريس            2/40- موسى 
3/40 -- هارون 
1/40- إدريس بن عبد العزيز بن عبد الجليل بن إبراهيم بن محمد بن عبدالقادر بن الهزبر 
واعقب:  
1/41-- محمد             2/41- أحمد 
3/41 - حمزة 
2/40- موسى بن عبد العزيز بن عبد الجليل بن إبراهيم بن محمد بن عبد القادر بن الهزبر 
واعقب: 
1/41- محمد              2/41- عمرو 
3/40 - هارون بن عبد العزيز بن عبد الجليل بن إبراهيم بن محمد بن عبد القادر بن الهزبر 
واعقب: 
1/41- -عبدالعزيز              2/41-- عبد السلام 
2/39- محمد بن عبد الجليل بن إبراهيم بن محمد بن عبد القادر بن الهزبر
واعقب: 
1/40- وليد               2/40- شهاب 
3/40- ماجد              4/40 - أمير
3/39- عبدالرزاق عبدالجليل بن إبراهيم بن محمد بن عبد القادر بن الهزبر
واعقب: 
1/40- أدهم             2/40- أمجد 
3/40- حسين 
4/39 - أحمد بن عبد الجليل بن إبراهيم بن محمد بن عبد القادر بن الهزبر
واعقب: 
1/40- مهيب 
5/39- مختار بن عبد الجليل بن إبراهيم بن محمد بن عبد القادر بن الهزبر
واعقب: 
1/40-         
ــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــ 
38/ 3 – عبد الرحمن بن  إبراهيم بن محمد بن عبد القادر بن الهزبر 
وأعقب:
39/ 1 – عبد الغني          39/ 2 – محمود  
3/39- أحمد (×) 
39/ 1 – عبد الغني بن عبد الرحمن بن  إبراهيم بن محمد بن عبد القادر بن الهزبر 
وأعقب:
40/ 1 –جميل (×)                40/ 2 – رشاد(شهيد) 
40/ 3 – مأمون          
40/ 2 – رشاد بن عبد الغني بن عبد الرحمن بن إبراهيم بن محمد بن عبد القادر بن الهزبر 
واعقب: 
1/41- محمد 
40/ 3 - مأمون بن عبد الغني بن عبدالرحمن بن إبرهيم بن محمد بن عبد القادر بن الهزبر 
واعقب: 
1/41- رشاد
أعقاب شارح البحر:
39/ 2 – محمود بن  عبد الرحمن بن إبراهيم بن محمد بن عبد القادر بن الهزبر  
وأعقب:
40/ 1 – محمد                40/ 2 – حسين 
40/ 3 – حسن                 
ـــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــ
36/ 2 – عبدالصمد بن عبد القادر بن الهزبر 
وأعقب:
37/ 1 – محمد(×)        37/ 2  – أحمد (×) 
37/ 1 – محمد بن محمد  بن عبد القادر بن الهزبر 
وأعقب:
38/ 1 – عبدالوهاب             38/ 2 – عبدالغني 
3/38 - يحيى 
1/38- عبد الوهاب بن محمد بن محمد بن عبدالقادر بن الهزبر 
واعقب:  
1/39- أحمد 
واعقب: 
1/40- محمد              
2/38- عبد الغني بن محمد بن محمد بن عبد القادر بن الهزبر 
واعقب: 
1/39- عبد الرقيب         2/39- محمد 
3/39 - أحمد                 4/39 - عبد الودود
1/39- عبد الرقيب بن عبد الغني بن محمد بن محمد بن عبد القادر بن الهزبر 
واعقب: 
1/40- بدر (شهيد)              2/40- حمزة 
3/40 - محمد                      4/40 - عبد الغني 
5/40 - أحمد 
2/39 - محمد بن عبد الغني بن محمد بن محمد بن عبد القادر بن الهزبر 
واعقب: 
1/40- هشام              2/40- مصطفى 
3/40- حسين            4/40 - عقيل 
3/39 - أحمد بن عبدالغني بن محمد بن محمد بن عبد القادر بن الهزبر 
وأعقب:
1/40-     
4/39 - عبد الودود بن عبد الغني بن محمد بن محمد بن عبد القادر بن الهزبر 
واعقب: 
1/40- مصطفى               2/40- محمد 
3/38 - يحيى بن محمد بن محمد بن عبد القادر بن الهزبر 
واعقب: 
1/39- عبدالله              2/39- عبد الباسط 
3/39 - عبد المعطي 
1/39- عبد الله بن يحيى بن محمد بن محمد بن عبد القادر بن الهزبر 
وأعقب:
1/40- ماجد             2/40- عماد 
3/40 - هيثم              40/ 4 - أكرم 
5/40 - حسين            6/40 - محمد 
1/40-ماجدبن عبدالله بن يحيى 
واعقب: 
1/41- عمار                2/41- محمد 
2/39- عبد الباسط بن يحيى بن محمد بن محمد بن عبد القادر بن الهزبر 
واعقب: 
1/40- محمد                2/40- أحمد 
3/39- عبد المعطي بن يحيى بن محمد بن محمد بن عبد القادر بن الهزبر 
واعقب: 
1/40-               2/40 -       
______
========================

========================
/////////////////////////////////////
         أعقاب = 
الحسن بن محمد بن إبراهيم بن عبد الرحمن الجنيد 
33/ 1 - الحسن بن محمد بن إبراهيم بن عبد الرحمن الجنيد
وأعقب: 
34/ 1 – محمد         34/ 2 - الحسن 
34/ 1 – محمد بن الحسن بن محمد بن إبراهيم بن عبد الرحمن الجنيد
وأعقب: 
36/ 1 – بشر 36/ 2 - علي 
36/ 1 – بشر بن محمد بن الحسن بن محمد بن إبراهيم بن عبد الرحمن الجنيد
وأعقب:
37/ 1 – أحمد 
وأعقب:
38/ 1 – عبد الوهاب 
وأعقب:
39/ 1 – عبد الكريم  
39/ 1 – عبد الكريم بن عبد الوهاب بن أحمد بن بشر بن محمد بن الحسن بن محمد بن إبراهيم بن عبد الرحمن الجنيد
وأعقب:
40/ 1 – أحمد    40/ 2 – محمد 
40/ 3 – عبد الله 40/ 4 – فهد 
40/ 1 – أحمد بن عبد الكريم بن عبد الوهاب بن أحمد بن بشر بن محمد بن الحسن بن محمد بن إبراهيم بن عبد الرحمن الجنيد
وأعقب:
41/ 1 – عبد الرحمن 
وأعقب:
42/ 1 – أحمد 42 / 2 – محمد 
40/ 2 – محمد بن عبد الكريم بن عبد الوهاب بن أحمد بن بشر بن محمد بن الحسن بن محمد بن إبراهيم بن عبد الرحمن الجنيد
وأعقب:
41/ 1 – محمد  41/ 2 – مصطفى ( شهيد ) 41/ 3 – جميل ( شهيد ) 41/ 4 – أمير 
41/ 5 – إلياس 41/ 6 – عزت ( × )  
40/ 3 – عبد الله بن عبد الكريم بن عبد الوهاب بن أحمد بن بشر بن محمد بن الحسن بن محمد بن إبراهيم بن عبد الرحمن الجنيد
وأعقب:      
41/ 1 - الحسين  41/ 2 – صادق 
41/ 3 – عبد الرحمن 41/ 4 – عاصم 
41/ 5 – هيثم      41 / 6 – خليل  
40/ 4 – فهد بن عبد الكريم بن عبد الوهاب بن أحمد بن بشر بن محمد بن الحسن بن محمد بن إبراهيم بن عبد الرحمن الجنيد
وأعقب:
41/ 1 – عصام 
ـــــــــــــــــــــــــــــــــــــــــــــــــــــــــــ
36/ 2 - سعيد بن علي بن محمد بن الحسن بن محمد بن إبراهيم بن عبد الرحمن الجنيد
وأعقب:
37/ 1 - 
_______ 
36/ 1 – عبد الله بن عبد الله بن الحسن بن الحسن بن محمد بن إبراهيم بن عبد الرحمن الجنيد
وأعقب:
37/ 1 – قاسم  37/ 2 – عبيد    
37/ 1 – قاسم بن عبد الله بن عبد الله بن الحسن بن الحسن بن محمد بن إبراهيم بن عبد الرحمن الجنيد 
وأعقب:
38/ 1 – عبد الله 38/ 2 – محمد
38/ 3 – يحي  
38/ 1 – عبد الله بن قاسم بن عبد الله بن عبد الله بن الحسن بن الحسن بن محمد بن إبراهيم بن عبد الرحمن الجنيد
وأعقب:
39/ 1 – عبد الرحمن 39/ 2 – محمد
39/ 3 – عبد الإله     39/ 4 – فهمي 
39/ 1 – عبد الرحمن بن عبد الله بن قاسم 
وأعقب:
40/ 1 – أكرم
______
38/ 2 – محمد بن قاسم بن عبد الله بن عبد الله بن الحسن بن الحسن بن محمد بن إبراهيم بن عبد الرحمن الجنيد
وأعقب:
39/ 1 – أحمد       39/ 2 – عبد الرحمن
39/ 3 – عبد المغني 
39/ 1 – أحمد بن محمد بن قاسم 
وأعقب:
40/ 1 – إبراهيم          40/ 2 – محمد
40/ 3 – عبد الحكيم 
40/ 1 – إبراهيم بن أحمد بن محمد بن قاسم 
وأعقب:
41/ 1 – حسين 
40/ 2 – محمد بن أحمد بن محمد بن قاسم 
وأعقب:
41/ 1 – علي           41/ 2 – محمد 
41/ 3 – عبد المعطي    41/ 4 – زين العابدين 
ـــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــ 
39/ 2 – عبد الرحمن بن محمد بن قاسم بن عبد الله 
وأعقب:
40/ 1 – محمد 40/ 2 – يوسف   
ــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــ 
39/ 3 – عبد المغني بن محمد بن قاسم بن عبد الله 
وأعقب:
40/ 1 – محمد 40/ 2 – مأمون 
ـــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــ
38/ 3 – يحي بن قاسم بن عبد الله بن عبد الله بن الحسن بن الحسن بن محمد بن ابراهيم بن عبد الرحمن الجنيد
وأعقب:
39/ 1 – عبد الغني       39/ 2 – عبد الله
39/ 3 – علي               39/ 4 – قاسم 
39/ 5 – عبد الرحمن 39/ 6 – محمد 
39/ 1 – عبد الغني بن يحي بن قاسم بن عبد الله 
وأعقب:
40/ 1 – محمود 40/ 2 – محمد
40/ 3 – عدنان  40/ 3 – عبد الله  ــــــــــــــــــــــــــــــــــــــــــــــــــــــــ
39/ 2 - عبد الله بن يحي بن قاسم بن عبد الله  
وأعقب:
40/ 1 – موسى 40/ 2 – فواز
40/ 3 – عبد الحكيم    
ــــــــــــــــــــــــــــــــــــــــــــــــــــ
39/ 3 – علي بن يحي بن قاسم بن عبد الله 
وأعقب:
40/ 1 – بدر 40/ 2 – سليمان  
ـــــــــــــــــــــــــــــــــــــــــــــ
39/ 4 – قاسم بن يحي بن قاسم بن عبد الله 
وأعقب:
40/ 1 – نشوان 40/ 2 – بلال  
ـــــــــــــــــــــــــــــــــــــــــــــ
39/ 5 – عبد الرحمن بن يحي بن قاسم بن عبد الله 
وأعقب:
40/ 1 – خليفة 40/ 2 – محمد 

ـــــــــــــــــــــــــــــــــــــــــــــ
39/ 6 – محمد بن يحي بن قاسم بن عبد الله 
وأعقب:
40/ 1 – وسيم 40/ 2 – عبد الرحمن  
ـــــــــــــــــــــــــــــــــــــــــــــ 
38/ 2 – منصور بن عبيد بن عبد الله بن عبد الله بن الحسن بن الحسن بن محمد بن إبراهيم بن عبد الرحمن الجنيد 
وأعقب:
39/ 1 – فاضل           39/ 2 – عبده (×)
39/ 3 – أحمد (×)
39/ 1 – فاضل بن منصور بن عبيد  بن عبد الله 
وأعقب:
40/ 1 – محمد 40/ 2 – مهيوب
40/ 3 – عبد الحق 40/ 4 – علي 
40/ 5 – عبد العزيز 40/ 6 – عبد الرحمن  
40/ 1 – محمد بن فاضل بن منصور بن عبيد  
وأعقب:
41/ 1 – أحمد 41/ 2 – فاضل    
40/ 2 – مهيوب بن فاضل بن منصور بن عبيد   
وأعقب:
41/ 1 – محمد 40 / 2 – علي  
40/ 3 – عبد الحق بن فاضل بن منصور بن عبيد  
وأعقب:
41/ 1 – محمد 41/ 2 – علي    
40/ 4 – علي بن فاضل بن منصور بن عبيد  
وأعقب:
41/ 1 – أحمد 
40/ 5 – عبد العزيز بن فاضل بن منصور بن عبيد   وأعقب:
41/ 1 – محمد       41/ 2 – يوسف 
41/ 3 – عمر  
40/ 6 – عبد الرحمن بن فاضل بن منصور بن عبيد  
وأعقب:
41/ 1 – أكرم       41/ 2 – حسين 
41/ 3 – حسن  
ـــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــ
""")
print("Part 9 written")
