with open('source_lineage.txt', 'a', encoding='utf-8') as f:
    f.write("""
أعقاب شارح البحر:
@@@@@@@@@@@@@        
                أعقاب // 
عبد الواسع بن الجنيد بن أحمد بن عثمان بن محمد بن محمد بن إبراهيم بن عبدالرحمن الجنيد 
وأعقب:
38/ 1 – محمد.          38/ 2 – عبداللطيف 
38/ 3- سعيد
____
38/ 1 – محمد بن عبدالواسع بن الجنيد بن أحمد بن عثمان 
وأعقب:
39/ 1 – عبدالوهاب.            39/ 2 – أحمد
39/ 3 - عبد الحميد(×)   
__
39/ 1 – عبدالوهاب بن محمد بن عبدالواسع بن الجنيد بن أحمد بن عثمان 
وأعقب:
40/ 1 – عبدالله بن عبدالوهاب بن محمد بن عبدالواسع 
وأعقب:
41/ 1 – عبدالرحمن.        41/ 2 – أنس
41/ 3 – علوي.                41/ 4 – مبارك.            41/ 5 – محمد 
41/ 1 – عبدالرحمن بن عبدالله بن عبدالوهاب 
وأعقب:
42/ 1 – محمد.         42/ 2 – عبدالوهاب
42/ 3 - احمد.           42/ 4 - حسين
__
41/ 2 – أنس بن عبدالله بن عبدالوهاب 
وأعقب:
42/ 1 – عبدالله 
__
41/ 3 – علوي بن عبدالله بن عبدالوهاب 
وأعقب:
42/ 1 – جوهر.         42/ 2 – زيد
__
41/ 4 – مبارك بن عبدالله بن عبدالوهاب 
وأعقب:
42/ 1 – علي
_ 
41/ 5 – محمد بن عبدالله بن عبدالوهاب 
وأعقب:
42/ 1 – عبدالوهاب
___
40/ 2 – محمد بن عبدالوهاب بن محمد بن عبدالواسع 
وأعقب:
41/ 1 – عبدالحكيم.           41/ 2 – محمد 
____
41/ 1 – عبدالحكيم بن محمد بن عبدالوهاب 
وأعقب:
42/ 1 – سجاد
___
41/ 2 – محمد بن محمد بن عبدالوهاب 
وأعقب:
42/ 1 –               42/ 2 –
____
40/ 3 – أحمد بن عبدالوهاب بن محمد بن عبدالواسع 
وأعقب:
41/ 1 – فضل (شهيد)           41/ 2 – الجنيد
41/ 3 – جعفر.                     41/ 4 - ابراهيم
_
41/ 1 – فضل بن أحمد بن عبدالوهاب 
وأعقب : (×)
____
41/ 2 – الجنيد بن أحمد بن عبدالوهاب 
وأعقب:
42/ 1 – فضل
___
41/ 3 – جعفر بن أحمد بن عبدالوهاب 
وأعقب :
42/ 1 – 
____
41/ 4 – ابراهيم بن أحمد بن عبدالوهاب 
وأعقب:
42/ 1 – 
__
40/ 4 – عبدالسلام بن عبدالوهاب بن محمد بن عبدالواسع 
وأعقب:
41/ 1 – محمد.         41/ 2 – عبدالله
41/ 3 – ياسين
ـــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــ
39/ 2 –  أحمد بن محمد بن عبدالواسع بن الجنيد بن أحمد بن عثمان 
وأعقب:
40/ 1 – أمين.              40/ 2 – عبدالودود  
__
40/ 1 – أمين بن أحمد بن محمد بن عبدالواسع 
وأعقب:
41/ 1 – محمد.            41/ 2 – حسين
41/ 3 – مرتضى.          41/ 4 – عباس (شهيد)
41/ 5 – حمزة.             41/ 6 – رضا
41/ 7 – عقيل.             41/ 8 – مهدي 
____
41/ 1 – محمد بن أمين بن أحمد بن محمد 
وأعقب:
42/ 1 – عبدالوهاب.            42/ 2 – احمد 
41/ 2 – حسين بن أمين بن أحمد بن محمد 
وأعقب:
42/ 1 – علي.            42/ 2 – محمد 
41/ 3 – مرتضى بن أمين بن أحمد بن محمد 
وأعقب:
42/ 1 – أمين.            42/ 2 – محمد 
41/ 5 – حمزة بن أمين بن أحمد بن محمد 
وأعقب:
42/ 1 – عباس
 
41/ 6 – رضا بن أمين بن أحمد بن محمد 
وأعقب :
42/ 1 – محمد.            42/ 2 – علي
___//
 40/ 1 – عبدالودود بن أحمد بن محمد بن عبدالواسع 
وأعقب:
41/ 1 – محمد.           41/ 2 – احمد  
41/ 3 – عمار
ــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــ
38/ 2 – عبداللطيف بن عبدالواسع بن الجنيد بن أحمد بن عثمان 
وأعقب:
40/ 1 – محمد بن قائد بن عبداللطيف بن عبدالواسع بن الجنيد بن أحمد بن عثمان 
وأعقب:
41/ 1 – محمود              41/ 2 – يونس  
_
41/ 1 – محمود بن محمد بن قائد بن عبداللطيف 
وأعقب:
42/ 1 – عبدالوهاب          42/ 2 – أحمد 
42/ 3 – محمد                 42/ 4 – المتوكل
42/ 5 – عبدالله 
__
42/ 1 – عبدالوهاب بن محمود بن محمد بن قائد 
وأعقب :
43/ 1 -
43/ 2 -
_
42/ 2 – احمد بن محمود بن محمد بن قائد 
وأعقب:
43/ 1 - عبدالله
_

41/ 2 – يونس بن محمد بن قائد د
وأعقب:
42/ 1 - محمد          42/ 2 - شهاب
ـــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــ 
38/ 3- سعيد بن عبدالواسع بن الجنيد بن أحمد بن عثمان 
وأعقب:
39/ 1 – قاسم             39/ 2 – إبراهيم
39/ 3 – أحمد (×)  
____
39/ 1 – قاسم بن سعيد بن عبدالواسع 
وأعقب:
40/ 1 – عبدالجليل             40/ 2 – محمد
40/ 3 – أحمد                    40/ 4 – عبدالله
__
40/ 1 – عبدالجليل بن قاسم بن سعيد 
وأعقب:
41/ 1 – عبدالرحمن             41/ 2 – عمار
41/ 3 – مبارك.                   41/ 4 – أمين   
____
41/ 2 – عمار بن عبدالجليل بن قاسم بن سعيد   
وأعقب:
42/ 1 - محمد              42/ 2 - علي
_____
40/ 2 – محمد بن قاسم بن  سعيد 
وأعقب:
41/ 1 – باسم                 41/ 2 – إبراهيم
41/ 3 – عبد الوهاب    41/ 4 - محمد
_
41/ 1 – باسم بن محمد بن قاسم بن سعيد 
وأعقب:
42/ 1 - حسين            42/ 2 - علي
42/ 3 - بدر الدين
_

40/ 3 – أحمد بن قاسم بن  سعيد 
وأعقب:
41/ 1 – عبدالرحمن          41/ 2 – محمد
41/ 3 - عبدالملك
_
41/ 1 – عبدالرحمن بن احمد بن قاسم بن سعيد 
وأعقب:
42/ 1 - محمد
_____
40/ 4 – عبدالله بن قاسم بن  سعيد 
وأعقب:
41/ 1 – أمجد.           41/ 2 – مجد
41/ 3 - قاسم
=============
39/ 2 – إبراهيم بن سعيد بن عبدالواسع بن الجنيد بن أحمد بن عثمان 
وأعقب:
40/ 1 – مصطفى (شهيد)      40/ 2 – عبدالملك 
40/ 3 – عبدالرحمن  
__
40/ 1 – مصطفى بن ابراهيم بن سعيد 
وأعقب:
41/ 1 - زيد        41/ 2 - حسين
_____
40/ 2 – عبدالملك بن ابراهيم بن سعيد 
وأعقب:
41/ 1 - محمد
__
40/ 3 – عبدالرحمن بن ابراهيم بن سعيد 
وأعقب:
41/ 1 - مصطفى.           41/ 2 - مرتضى
41/ 3 - إبراهيم
ـــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــ
******

****
**=======//===***       
           أعقاب // 
عبد الملك بن أحمد بن عثمان بن محمد بن محمد بن إبراهيم بن عبد الرحمن الجنيد 
وأعقب: 
37/ 1 – عبد المجيد            37/ 2 –  عبداللطيف 
__
37/ 1 – عبد المجيد بن عبد الملك بن أحمد بن عثمان بن محمد بن محمد بن إبراهيم بن عبدالرحمن الجنيد وأعقب :  
38/ 1 – بشر          38/ 2 – عبدلله
38/ 1 – بشر بن عبد المجيد بن عبد الملك بن أحمد بن عثمان
وأعقب: 
39/ 1 عبدالقادر      39/ 2 - عبد الشافي (× )  
39/ 3–عبدالله
____
41/ 1 – عبد الوهاب بن محمد بن عبد القادر بن بشر بن عبد المجيد بن عبد الملك بن أحمد بن عثمان
وأعقب: 
42/ 1–الحسين           42/ 2–الحسن
42/ 3– مصطفى
____
41/ 2 – عبد الرحمن بن محمد بن عبد القادر بن  بشر بن عبد المجيد بن عبد الملك بن أحمد بن عثمان
وأعقب: 
42/ 1 – محمد             42/ 2– السجاد 
42/ 3– ابوطالب.          42/ 4 – احمد 
42/ 5– زيد                  42/ 6–ا لمرتضى ____
39/ 3 –عبد الله بن  بشر بن عبدالمجيد بن عبدالملك بن أحمد بن عثمان 
وأعقب: 
40/ 1– إبراهيم.               40/ 2 – حمود  
40/ 3 – أحمد ( × ) 40/ 4 – محمد
____
40/ 1- إبراهيم بن عبد الله بن  بشر بن عبد المجيد بن عبد الملك بن أحمد بن عثمان
وأعقب: 
41/ 1 – عبد الرحمن.         41/ 2 – محمد (شهيد)
41/ 3 – خليل                   41/ 4 – فؤاد    
41/ 5 – بشر                     41/ 6 -وسيم    
41/ 1 – عبد الرحمن بن ابراهيم بن عبدالله بن بشر وأعقب:  
42/ 1- كمال
_____
40/ 2 – حمود  بن عبد الله بن  بشر بن عبد المجيد بن عبد الملك بن أحمد بن عثمان
وأعقب: 
41/ 1 – ماجد
 __
40/ 4 – محمد عبد الله بن بشر بن عبد المجيد بن عبد الملك بن أحمد بن عثمان
وأعقب: 
41/ 1 – احمد.           41/ 2 – امجد
==========
 37/ 2 – عبداللطيف بن عبد الملك بن أحمد بن عثمان
وأعقب: 
38/ 1- احمد             38/ 2- محم
38/ 1- احمد بن عبداللطيف بن عبدالملك بن احمد بن عثمان 
وأعقب: 
39/ 1- عبدالإله( ×) شرد من المنطقة ولا نعلم له اثر. 
_____
38/ 2 - محمد بن عبداللطيف بن عبدالملك بن احمد بن عثمان 
وأعقب: 
39/ 1- عبدالرب          39/ 2- عبدالغني
39/ 3- عبدالواحد
____
40/ 1- قاسم بن عبدالرب بن محمد بن عبداللطيف بن عبدالملك بن احمد بن عثمان 
وأعقب:  
41/ 1 – محمد      41/ 2 - فؤاد
_____
41/ 2 – صادق بن أحمد بن عبدالغني بن محمد بن عبداللطيف بن عبد الملك بن أحمد بن عثمان
وأعقب: 
42/ 1 – وليد          42/ 2 - محمد
__
41/ 2 – عبد الرؤوف بن أحمد بن عبد الغني بن محمد بن عبداللطيف بن عبد الملك بن أحمد بن عثمان 
وأعقب : 
42/ 1 – أحمد
__
39/ 3- عبدالواحد بن محمد بن عبداللطيف بن عبدالملك بن احمد بن عثمان 
أعقب :
40/ 1 –  عبدالغفار (×) 40/ 2 – محمد
40/ 2 - محمد بن عبدالواحد بن محمد بن عبداللطيف بن عبدالملك بن احمد بن عثمان 
وأعقب: 
41/ 1- منير         41/ 2- زياد
41/ 3 - عبدالحكيم (×) هناك روايات واخبار بان المذكور لديه ولد سكن مع امه منذ صغره في مديرية بني حشيش صنعاء. 
___
40/ 1- قاسم بن عبد الرب بن محمد بن عبد اللطيف بن عبد الملك بن أحمد بن عثمان
وأعقب: 
41/ 1 –محمد            41/ 2 – فؤاد
41/ 1 – محمد بن قاسم بن عبد الرب بن محمد بن عبداللطيف بن عبد الملك بن أحمد بن عثمان
وأعقب: 
42/ 1 –             42/ 2 –
42/ 3 –

افادنا اخوه فؤاد بأنه ساكن مع اسرته في عدن ولديه 8 اولاد لا يعلم اسمائهم .
____
41/ 2 – فؤاد بن قاسم بن عبدالرب بن محمد بن عبد اللطيف بن عبد الملك بن أحمد بن عثمان
وأعقب: 
42/ 1- احمد.             42/ 2- محمد
42/ 3- رياض 
*******
**=============///======**
""")
print("Part 6 written")
