with open('source_lineage.txt', 'a', encoding='utf-8') as f:
    f.write("""
من أعقاب السيد الشريف // 

 أحمد بن عبد الله الحضرمي بن محمد بن محمد بن علي بن القاسم بن  أحمد البركاني 

ـــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــ
27 / 1 - شارح البحر  //

(( أحمد بن عبد الله الحضرمي بن محمد بن محمد بن علي بن القاسم بن الشيخ أحمد البركاني بن بركات بن الشيخ سعيد بن أبي الأسرار علي بن إبراهيم السروري بن علي بن محمد بن بن الحسن بن المحسن بن يحي الصوفي بن جعفر الزكي بن علي الهادي  بن محمد الجواد بن علي الرضا بن موسى الكاظم بن جعفر الصادق بن محمد الباقر بن علي زين العابدين بن سيد الشهداء وسيد شباب أهل الجنة الامام السبط الحسين بن فاطمة بنت المصطفى وابن  علي المرتضى سلام الله عليهم أجمعين ))
وأعقب :
28/ 1 - الشيخ/ محمد [ لا نعلم له عقب  ] 
28/ 2 - الشيخ/ عبيد [ لا نعلم له عقب  ]
28/ 3 - الشيخ/ عبد الرحمن ساكن النقل بن أحمد شارح البحر بن عبد الله الحضرمي.

          اعقاب الشيخ / عبد الرحمن ساكن النقل بن شارح البحر أحمد بن عبد الله الحضرمي
                واعقب :

29/ 1 - الشيخ / لطف الله ( اسكندر ) بن عبد الرحمن ساكن النقل بن أحمد بن عبد الله الحضرمي [ ولا نعلم له عقب ].

29 / 2 - الشيخ / عبد الله بن عبد الرحمن النقل بن شارح البحرأحمد بن عبد الله الحضرمي
             وأعقب: لا نعلم

29 / 3 - الشيخ / أحمد بن عبد الرحمن النقل بن شارح البحر أحمد الحضرمي 
وأعقب :
30 / 1 - الجنيد        30 / 2 - عمر
=========
30 / 1 - الجنيد بن أحمد بن عبد الرحمن النقل بن شارح البحر الحضرمي
وأعقب:
عقبه في جبل حبشي
=============
30 / 2 - عمر بن أحمد بن عبد الرحمن النقل بن شارح البحر الحضرمي
وأعقب:
31 / 1 -أحمد (وعقبه في الحشأ والضالع)
==============

29 / 4 - الشيخ محمد جمال الدين بن عبد الرحمن النقل بن أحمد شارح البحر بن عبد الله الحضرمي
٠ط

[ أعقاب السيد الولي الصالح // أبو الجنيد -  محمد جمال الدين بن عبدالرحمن النقل بن أحمد شارح البحر بن عبد الله الحضرمي ] .

وأعقب :

31 / 1 -  بشر الجنيد  
31 / 2 - أحمد الجنيد    
31 / 3 - عبد الرحمن الجنيد
 

          أعقاب 
بشر الجنيد بن محمد جمال الدين بن عبد الرحمن صاحب النقل بن شارح البحر أحمد بن عبد الله  الحضرمي .

                أعقاب 
أحمد الجنيد بن محمد جمال الدين بن عبد الرحمن صاحب النقل بن شارح البحر أحمد بن عبد الله  الحضرمي .

          
//*//**//****
الفرع الثاني:
                أعقاب= 
عبد الرحمن الجنيد بن محمد جمال الدين بن عبد الرحمن ساكن النقل بن شارح البحر أحمد بن عبد الله  الحضرمي.. .
وأعقب :
31/ 1 - إبراهيم        31/ 2- العيدروس    
31/ 3- فاضل          
//========//=====//====
            أعقاب=
إبراهيم بن عبد الرحمن الجنيد
وأعقب:
32/ 1= عبَّاد(×)             32/ 2= محمد     
32/ 3= علي                  32/ 4= إسماعيل
32/ 5= بشر(×)              32/ 6= حاجب      
32/ 7= مالك (×)            32/ 8= 
_______
         أعقاب=
محمد بن إبراهيم
                أعقاب/
أحمد بن عثمان بن محمد بن محمد بن إبراهيم بن عبد الرحمن الجنيد

وأعقب :

36/ 1 – فاضل(×)   36/ 2 – علي (×)
36/ 3 – محمد              36/ 4 -عبد الملك  
36/ 5 – عبد الله           36/ 6- الجنيد 
36/ 7 – عثمان       36/ 8 – فضل   
36/ 9 - منصور (×) 
ــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــ
           أعقاب /
محمد بن أحمد بن عثمان بن محمد بن إبراهيم بن عبد الرحمن الجنيد
وأعقب 

37/ 1 – علي بن محمد بن أحمد بن عثمان (×)
38/ 1 – إبراهيم بن عبد الوهاب بن محمد بن أحمد بن عثمان (×)   
40/ 1 – عبد الرحمن بن عبد الله بن عبد الغني بن عبد الوهاب(×)
40/ 2 - محمد بن عبد الله بن عبد الغني بن عبد الوهاب
وأعقب:
41/ 1 – عبد الوهاب 41/ 2 – عبد السلام 
41/ 3 – أحمد          41/ 4 – علي 
41/ 5 – خالد    41/ 6 – محمد  

41 / 1 – عبد الوهاب بن محمد بن عبد الله   
وأعقب :
42/ 1 – محمد   42/ 2 – الحمزة 
ـــــــــــــــــــــــــــــــ
41/ 2 – عبد السلام بن محمد بن عبد الله   
وأعقب : 
42/ 1 – الرضا    42/ 2 – محمد 
ـــــــــــــــــــــــــــــــــــــــــــــ
41/ 3 – أحمد بن محمد بن عبد الله   
واعقب :
42/ 1 – صدام ( شهيد )  42/ 2 – عدنان  
42/ 3 – محمد               42/ 4 – علي 
ـــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــ
41/ 4 – علي بن محمد بن عبد الله

واعقب :
42/ 1 – الحسين   42/ 2 – زيد   
ــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــ
41/ 5 – خالد بن محمد بن عبد الله   
واعقب:
42/ 1 – زيد   42/ 2 – محمد  ــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــ
41/ 6 – محمد بن محمد بن عبد الله   
واعقب :
42/ 1 –    42/ 2 –  
ــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــ
40/ 3 – عبد القادر بن عبد الله بن عبد الغني بن عبد الوهاب بن محمد بن أحمد بن عثمان    
واعقب : 
41/ 1 – عبد الحكيم      41/ 2 – محمود   
41/ 3 – عبد الإله          41/ 4 – الحسين
41/ 5 – المرتضى          41/ 6 – المؤيد
__
41/ 1 – عبد الحكيم بن عبد القادر بن عبد الله   
واعقب : 
42/ 1 – المطهر               42/ 2 – محمد   
42/ 3 – جوهر (شهيد)      42/ 4 – أحمد (شهيد)      42/ 5 – الحمزة  

42/ 1 – مطهر بن عبد الحكيم بن عبد القادر     
واعقب : 
43/ 1 – محمد 

42/ 1 – محمد بن عبد الحكيم بن عبد القادر     
واعقب : 
43/ 1 – جوهر 
ـــــــــــــــــــــــــــــــــــــــــــــــ
41/ 2 – محمود بن عبد القادر بن عبد الله    
واعقب: 
42/ 1 – أحمد       42/ 2 – محمد    
42/ 3 – عبد الله      42/ 4 – مصطفى   
ــــــــــــــــــــــــــــــــــــــــــــــــــــــــ   
41/ 3 – عبد الإله بن عبد القادر بن عبد الله    
واعقب : 
42/ 1 – زيد             42/ 2 – محمد    
42/ 3 – إبراهيم        42/ 4 – إسماعيل   
42/ 5 – علي            42/ 6 – أحمد 
42/ 3 – زيد بن عبد الإله بن عبد القادر    
واعقب : 
43/ 1 – الحسين
ــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــ
41/ 4 – الحسين بن عبد القادر بن عبد الله    
واعقب : 
42/ 1 – محمد         42/ 2 – علي   

41/ 5 – المرتضى بن عبد القادر بن عبد الله   
واعقب : 
42/ 1 – محمد      
41/ 6 – المؤيد بن عبد القادر بن عبد الله    
واعقب : 
42/ 1 – زيد         42/ 2 – محمد   
42/ 3 - 
ــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــ 
40/ 4 – سعيد بن عبد الله بن عبد الغني بن عبد الوهاب بن محمد بن أحمد بن عثمان   
واعقب: 
41/ 1 – أمين  41/ 2 – نبيل ( × )    
41/ 3 – فهد        41/ 4 – بسام   
41/ 5 – مرتضى   41/ 6 – مطهر 
41/ 7 – صدام      41/ 8 – محمد 

41/ 1 – أمين بن سعيد بن عبد الله    
واعقب : 
42/ 1  -الحمزة   42/ 2 – محمد 
ـــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــ
41/ 3 – فهد بن سعيد بن عبد الله   
واعقب : 
42/ 1 – محمد   42/ 2 – أحمد 

41/ 4 – بسام بن سعيد بن عبد الله   
واعقب : 
42/ 1 –              42/ 2 –    
 
41/ 8 – محمد بن سعيد بن عبد الله   
واعقب : 
42/ 1 – إبراهيم    42/ 2 –    
ـــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــ
40/ 5 – علي بن عبد الله بن عبد الغني بن عبد الوهاب بن محمد بن أحمد بن عثمان    
واعقب: 
41/ 1 – عبد الرحمن 41/ 2 – محمد 
41/ 3 – عبد الغني   41/ 4 – عدنان  
41/ 5 – زيد 

41/ 1 – عبد الرحمن بن علي بن عبد الله   
واعقب: 
42/ 1 – أحمد 

41/ 2 – عبد الغني  بن علي بن عبد الله   
وأعقب: 
42/ 1 – عبد الله  
ــــــــــــــــــــــــــــــــــــــــــــــــــ
40/ 5 – أحمد بن عبد الله بن عبد الغني بن عبد الوهاب بن محمد بن أحمد بن عثمان   
وأعقب: 
41/ 1 – هاني     41/ 2 - عبد الله 

41/ 1 – هاني بن أحمد بن عبد الله   
وأعقب: 
42/ 1 – أحمد 
ـــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــ
39/ 2 – سيف بن عبد الغني بن عبد الوهاب بن محمد بن أحمد بن عثمان   
واعقب : 
40/ 1 – محمد 
40/ 1 – محمد بن سيف بن عبد الغني بن عبد الوهاب   
واعقب: 
41/ 1 – عبد الوهاب     41/ 2 – محمد  
41/ 3 – أحمد        41 / 4 – عبد الرحمن (شهيد)    

 41/ 5 – عبد الرؤوف        41/ 6 – 

41/1 – عبد الوهاب بن محمد بن سيف   
واعقب: 
42/ 1 –  محمد    42/ 2 –    
42/ 3 –   42/ 4 – 

41/ 2 – محمد بن محمد بن سيف   
واعقب: 
42/ 1 – الحمزة          

41/3 – أحمد بن محمد بن سيف   
واعقب: 
42/ 1 –     
""")
print("Part 4 written")
