with open('source_lineage.txt', 'a', encoding='utf-8') as f:
    f.write("""
@@@@@@@@@@@@@@@@@@
                 أعقاب = 
إبراهيم بن محمد بن إبراهيم بن عبد الرحمن الجنيد 
33/ 2 - إبراهيم بن محمد بن إبراهيم بن عبد الرحمن الجنيد 
وأعقب : 
34/ 1 – عبد الرحمن        34/ 2 –  
                  
34/ 2 - عبد الرحمن بن إبراهيم بن محمد بن إبراهيم بن عبد الرحمن الجنيد 
وأعقب : 
35/ 1 – عبد الكريم.        35/ 2 -  
35/ 2 - عبد الكريم بن عبد الرحمن بن إبراهيم بن محمد بن إبراهيم بن عبد الرحمن الجنيد 
وأعقب : 
36/ 1 – أحمد            36/ 2 - 

36/ 1 – أحمد بن عبد الكريم بن عبد الرحمن بن إبراهيم بن محمد بن إبراهيم بن عبد الرحمن الجنيد
وأعقب : 
37/ 1 – جعفر        37/ 2 – أحمد 
37/ 3 –                    37 / 4 –   
37/ 1 – جعفر بن أحمد بن عبد الكريم بن عبد الرحمن بن إبراهيم بن محمد بن إبراهيم بن عبد الرحمن الجنيد 
وأعقب : 
38/ 1 – محمد       38/ 2 – عبد القادر  
38/ 1 – محمد بن جعفر بن أحمد بن عبد الكريم بن عبد الرحمن بن إبراهيم بن محمد بن ابراهيم بن عبد الرحمن الجنيد 
وأعقب : 
39/ 1 – عبد السلام       39/ 2 – عبد الرزاق  
39/ 1 – عبد السلام بن محمد بن جعفر بن أحمد بن عبد الكريم بن عبد الرحمن بن إبراهيم بن محمد بن ابراهيم بن عبد الرحمن الجنيد 
وأعقب : 
40/ 1 – أمين     40/ 2 – معمر 
40/ 1 – أمين بن عبد السلام بن محمد بن جعفر بن أحمد بن عبد الكريم بن عبد الرحمن بن إبراهيم بن محمد  بن ابراهيم بن عبد الرحمن الجنيد  
وأعقب : 
41/ 1 -  
40/ 1 – معمر بن عبد السلام بن محمد بن جعفر بن أحمد بن عبد الكريم بن عبد الرحمن بن إبراهيم بن محمد بن ابراهيم بن عبد الرحمن الجنيد  
وأعقب : 
41/ 1 – أمين 
ــــــــــــــــــــــــــــــــــــــــــــــــــــــــــ 
39/ 2 – عبد الرزاق بن محمد بن جعفر بن أحمد بن عبد الكريم بن عبد الرحمن بن إبراهيم بن محمد بن ابراهيم بن عبد الرحمن الجنيد 
وأعقب : 
40/ 1 – محمود   
40/ 1 – محمود بن عبد الرزاق بن محمد بن جعفر بن أحمد بن عبد الكريم بن عبد الرحمن بن إبراهيم بن محمد بن ابراهيم بن عبد الرحمن الجنيد  
وأعقب : 
41/ 1 – محمد 
ــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــ 
38/ 2 – عبد القادر بن جعفر بن أحمد بن عبد الكريم بن عبد الرحمن بن ابراهيم بن محمد بن إبراهيم بن عبد الرحمن الجنيد 
وأعقب : 
39/ 1 – محمد           39/ 2 – أحمد 
 
39/ 1 – محمد بن عبد القادر بن جعفر بن أحمد بن عبد الكريم بن عبد الرحمن بن إبراهيم بن محمد بن إبراهيم بن عبد الرحمن الجنيد  
وأعقب : 
40/ 1 – نجيب     40/ 2 – توفيق
40/ 3 – 
40/ 1 – نجيب بن محمد بن عبد القادر بن جعفر بن أحمد بن عبد الكريم بن عبد الرحمن بن إبراهيم بن محمد بن إبراهيم بن عبد الرحمن الجنيد 
وأعقب : 
41/ 1 -  
40/ 2 – توفيق بن محمد بن عبد القادر بن جعفر بن أحمد بن عبد الكريم بن عبد الرحمن بن إبراهيم بن محمد بن إبراهيم بن عبد الرحمن الجنيد 
وأعقب : 
41/ 1 -  
ــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــ 
39/ 1 – أحمد بن عبد القادر بن جعفر بن أحمد بن عبد الكريم بن عبد الرحمن بن إبراهيم بن محمد بن إبراهيم بن عبد الرحمن الجنيد  
وأعقب : 
40/ 1 – 40/ 2 –
40/ 3 –     40/ 4 –  
40/ 1 – بن أحمد بن عبد القادر بن جعفر بن أحمد بن عبد الكريم بن عبد الرحمن بن إبراهيم بن محمد بن إبراهيم بن عبد الرحمن الجنيد 
وأعقب : 
41/ 1 -  
40/ 2 – بن أحمد بن عبد القادر بن جعفر بن أحمد بن عبد الكريم بن عبد الرحمن بن إبراهيم بن محمد بن إبراهيم بن عبد الرحمن الجنيد 
وأعقب : 
41/ 1 -  
ـــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــ 
38/ 2 – أحمد بن أحمد بن أحمد بن عبد الكريم بن عبد الرحمن بن إبراهيم بن محمد بن إبراهيم بن عبد الرحمن الجنيد 
وأعقب :
39/ 1 - قاسم               39/ 2 - عبد الكريم
39/ 3 - عبد الملك 
39/ 1 - قاسم بن أحمد بن أحمد بن أحمد بن عبد الكريم بن عبد الرحمن بن إبراهيم بن محمد بن إبراهيم بن عبد الرحمن الجنيد 
وأعقب :
40/ 1 – عبد العزيز       40/ 2 – عبد الفتاح 
40/ 3 – عبد الوهاب     40/ 4 – عبد الرحمن 
39/ 5 – أحمد 
40/ 1 – عبد العزيز بن قاسم بن أحمد بن أحمد بن أحمد بن عبد الكريم بن عبد الرحمن بن إبراهيم بن محمد بن إبراهيم بن عبد الرحمن الجنيد 
وأعقب : 
41/ 1 – مروان      40/ 2 – عمر 
41/ 3 – طه          41/ 4 – أنور 
41/ 5 – طلال 41/ 6 – أحمد      
41/ 7 –  محمد 
ــــــــــــــــــــــــــــــ
أعقاب شارح البحر:
40/ 2 – عبد الفتاح بن قاسم بن أحمد بن أحمد بن أحمد بن عبد الكريم بن عبد الرحمن بن إبراهيم بن محمد بن إبراهيم بن عبد الرحمن الجنيد 
وأعقب : 
41/ 1 – محمد       41/ 2 – وليد 
41/ 3 – أمجد        41/ 4 –  
ـــــــــــــــــــــــــــــ 
40/ 3 – عبد الوهاب بن قاسم بن أحمد بن أحمد بن أحمد بن عبد الكريم بن عبد الرحمن بن إبراهيم بن محمد بن إبراهيم بن عبد الرحمن الجنيد 
وأعقب : 
41/ 1 – ماجد       41/ 2 – مصطفى 
41/ 3 – عبد المغني   41/ 4 –

ــــــــــــــــــــــــــــــ 
40/ 4 – عبد الرحمن بن قاسم بن أحمد بن أحمد بن أحمد بن عبد الكريم بن عبد الرحمن بن إبراهيم بن محمد بن إبراهيم بن عبد الرحمن الجنيد 
وأعقب : 
41/ 1 – عدنان 41/ 2 – عبد الباسط 
ـــــــــــــــــــــــــــــــــــــــــــــــــــ 
40/ 5 – أحمد بن قاسم بن أحمد بن أحمد بن أحمد بن عبد الكريم بن عبد الرحمن بن إبراهيم بن محمد بن إبراهيم بن عبد الرحمن الجنيد 
وأعقب : 
41/ 1 – يونس       41/ 2 – نوفل 
41/ 3 – نشوان      41/ 4 – عبد الله 
41/ 5 – عبد الكريم 
ـــــــــــــــــــــــــــــــــــــــــــــــــــــــــ 
39/ 3 – عبد الكريم بن أحمد بن أحمد بن أحمد بن عبد الكريم بن عبد الرحمن بن إبراهيم بن محمد بن إبراهيم بن عبد الرحمن الجنيد 
وأعقب : 
40/ 1 – فؤاد          40/ 2 – جميل
40/ 3 - عبد الباري     40/ 4 – جلال
40/ 5 – باسم           40/ 6 – عبد السلام  
40/ 7 -سمير  
ـــــــــــــــــــــــــــــــــــــــــ 
39/ 4 – عبد الملك بن أحمد بن أحمد. بن أحمد بن عبد الكريم بن عبد الرحمن بن إبراهيم بن محمد بن إبراهيم بن عبد الرحمن الجنيد 
وأعقب : 
40/ 1 –        40/ 2 –
40/ 3 –        40/ 4 – 
ــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــ
   

================
@@@@@@@@@@@@@@@@@@ 
             أعقاب = 
الحسين بن محمد بن إبراهيم بن عبد الرحمن الجنيد 
الفرع الأول//            
36/ 1 - عبد الله بن أمير بن محمد بن الحسين بن محمد بن إبراهيم بن عبد الرحمن الجنيد  
وأعقب:
37/ 1 – قاسم          37/ 2 – عبد السلام  
37/ 3 – أحمد          37/ 4 – محمد  
37/ 1 – قاسم بن عبد الله  بن أمير 
وأعقب:
38/ 1 – محمد 38/ 2 – عبد الجليل  
38/ 3 – محيا   
38/ 1 – محمد بن قاسم بن عبد الله  بن أمير 
وأعقب :
39/ 1 – إبراهيم  
39/ 1 – إبراهيم بن محمد بن قاسم بن عبد الله بن أمير 
وأعقب: 
40/ 1 – عبد الجبار          40/ 2 – عبد الحميد 
40/ 3 – علي                  40/ 3 – محمد (×)    
40/ 1 – عبد الجبار بن إبراهيم بن محمد بن قاسم بن  
عبد الله بن أمير 
وأعقب:
41/ 1 – حمدي               41/ 2 – محمد 
41/ 3 – عزيز                    41/ 4 - زين العابدين
41/ 1 – حمدي بن عبد الجبار بن إبراهيم 
وأعقب:
42/ 1 – إبراهيم 
41/ 2 – محمد بن عبد الجبار بن إبراهيم 
وأعقب:
42/ 1 – أحمد 
41/ 1 – عزيز بن عبد الجبار بن إبراهيم 
وأعقب:
42/ 1 – 
41/ 1 – زين العابدين بن عبد الجبار بن إبراهيم 
وأعقب:
42/ 1 – علي

40 / 2 – عبد الحميد بن إبراهيم بن محمد بن قاسم بن عبد الله  بن أمير 
وأعقب:
41/ 1 – فؤاد             41/ 2 – عبد الباري 
41/ 3 – محمود          41/ 4 – أمين  
41/ 5 – محمد            41/ 6 – الجنيد  
41/ 1 – فؤاد بن عبد الحميد بن إبراهيم 
وأعقب:
42/ 1 – محمد         42/ 2 – حمزة
         
41/ 2 – عبد الباري بن عبد الحميد بن إبراهيم 
وأعقب:
42/ 1 –             
41/ 3 – محمود بن عبد الحميد بن إبراهيم 
وأعقب:
42/ 1 – 42/ 2 –      
41/ 4 – أمين بن عبد الحميد بن إبراهيم 
وأعقب:
42/ 1 –      
41/ 5 – محمد بن عبد الحميد بن إبراهيم 
وأعقب:
42/ 1 –       
41/ 6 – الجنيد بن عبد الحميد بن إبراهيم 
وأعقب: 
42/ 1 – عبد المعطي             42/ 2 – ليث 
40/ 3 – علي بن إبراهيم بن محمد بن قاسم بن عبد الله بن أمير 
وأعقب:
41/ 1 – منصور  41/ 2 – عبد الرحمن 
41/ 3 – عمر  41/ 4 –  حسين   
41/ 5 – محمد    
41/ 1 – منصور بن علي بن إبراهيم  
وأعقب: 
42/ 1 – 
41/ 2 – عبد الرحمن بن علي بن إبراهيم 
وأعقب:
42/ 1 –  
41/ 3 – عمر بن علي بن إبراهيم 
وأعقب: 
42/ 1 –      
41/ 4 –  حسين بن علي بن إبراهيم 
وأعقب: 
42/ 1 –       
41/ 5 – محمد بن علي بن إبراهيم 
وأعقب:
42/ 1 –          
ـــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــ 
38/ 1 – عبد الجليل بن قاسم بن عبد الله بن أمير بن محمد بن الحسين بن محمد بن ابراهيم بن عبد الرحمن الجنيد
وأعقب:
39/ 1 – أحمد           39/ 2 – محمد   
39/ 3 – عبد الرحمن   39/ 4 – عبد الكافي   
39/ 5 – محمد الثاني  
39/ 1 – أحمد بن عبد الجليل بن قاسم بن عبد الله بن أمير 
وأعقب:
40/ 1 – محمد       40/ 2 – سلطان 
40/ 3 – جميل      40/ 4 – سليمان    
40/ 5 – طه               40/ 6 – حسين  
40/ 7 – عبد الجبار    40/ 8 – مصطفى   
40/ 1 – محمد بن أحمد بن عبد الجايل      
وأعقب:
41/ 1 -          
40/ 2 – سلطان بن أحمد بن عبد الجليل 
وأعقب:
41/ 1 -            
40/ 3 – جميل بن أحمد بن عبد الجليل
وأعقب:
41/ 1 -            41/ 2 - 
40/ 4 – سليمان بن أحمد بن عبد الجليل
وأعقب:
41/ 1 -              41/ 2 -
  
40/ 5 – طه بن أحمد بن عبد الجليل
وأعقب:
41/ 1 -          41/ 2 - 
40/ 6 – حسين بن أحمد بن عبد الجليل 
وأعقب:
41/ 1 -            41/ 2 - 
40/ 7 – عبد الجبار بن أحمد بن عبد الجليل
وأعقب:
  41/ 1 -           41/ 2 - 
40/ 8 – مصطفى بن أحمد بن عبد الجليل
وأعقب:
41/ 1 -            41/ 2 -   

39/ 2 – محمد عبد الجليل بن قاسم بن عبد الله  بن أمير 
وأعقب:
40/ 1 – محمد      40/ 2 – عبد الباسط 
40/ 3 – عدنان     40/ 4 – عبد المعين   
40/ 1 – محمد بن محمد عبد الجليل بن قاسم بن عبد الله  بن أمير 
وأعقب: 
41/ 1 –         
40/ 2 – عبد الباسط بن محمد عبد الجليل بن قاسم بن عبد الله بن أمير  
وأعقب: 
41/ 1 –      
40/ 3 – عدنان بن محمد عبد الجليل بن قاسم بن عبد الله بن أمير 
وأعقب: 
41/ 1 –      
40/ 4 – عبد المعين بن  محمد عبد الجليل بن قاسم بن عبد الله بن أمير 
وأعقب:
41/ 1 –      
39/ 3 – عبد الرحمن عبد الجليل بن قاسم بن عبد الله بن أمير 
وأعقب:
40/ 1 – محمد 40/ 2 – عبد الصبور

40/ 1 – محمد بن عبد الرحمن عبد الجليل بن قاسم بن عبد الله بن أمير 
وأعقب: 
41/ 1 –  
40/ 3 – عبد الصبور بن عبد الرحمن عبد الجليل بن قاسم بن عبد الله بن أمير 
وأعقب: 
41/ 1 –  ـــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــ 
38 / 1 – محيا بن قاسم بن عبد الله بن أمير 
وأعقب:
39/ 1 – أحمد       39/ 2 – عبد الباقي   
39/ 3 – عبد الوهاب      
39/ 1 – أحمد بن محيا بن قاسم بن عبد الله بن أمير 
وأعقب:
40/ 1 – عبد الرحمن 40/ 2 – يوسف 
40/ 3 – حسين     
39/ 2 – عبد الباقي بن محيا بن قاسم بن عبد الله  بن أمير 
وأعقب: 
40/ 1 – مصطفى     40/ 2 – محمد   
39/ 3 – عبد الوهاب بن محيا بن قاسم بن عبد الله  بن أمير 
وأعقب:
40/ 1 – أحمد  
40/ 1 – أحمد بن عبد الوهاب بن محيا بن قاسم بن عبد الله بن أمير 
وأعقب: 
41/ 1 –     
ـــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــ 
37/ 1 – عبد السلام بن عبد الله بن أمير بن محمد بن الحسين بن محمد بن إبراهيم بن عبد الرحمن الجنيد
وأعقب:
38/ 1 – محمد  2/38 - هزاع 
3/38 - صالح 
38 / 1 – محمد بن عبد السلام بن عبد الله بن أمير 
وأعقب:
39/ 1 – عبد الكريم       39/ 2 – أحمد 
39/ 3 – حمود          39/ 4 – سلطان  
39/ 1 – عبد الكريم بن محمد بن عبد السلام 
وأعقب:
40/ 1 – محمد        40/ 2 – مصطفى 
40/ 3 – عبد القاهر  40/ 4 – عبد الله    
40/ 5 – شاكر         40/ 6 – ذاكر  
40 / 1 – محمد بن عبد الكريم بن محمد بن عبد السلام 
وأعقب: 
41/ 1 – منير 41/ 2 – عاصم  
40 / 2 – مصطفى بن عبد الكريم بن محمد بن عبد السلام 
وأعقب:
41/ 1 – خليل 41/ 2 – محمد 
41/ 3 – أحمد 
39/ 2 – أحمد بن محمد بن عبد السلام بن عبد الله  بن أمير 
وأعقب:
40/ 1 – صادق    40/ 2 – عبد المعطي 
40/ 3 – خالد          40/ 4 – عبد الناصر     
40/ 5 – معتصم 40/ 6 – وليد  
40/ 7 – محمد   
40 / 1 – صادق بن أحمد بن محمد بن عبد السلام 
وأعقب:
41/ 1 – محمد 41/ 2 - حمزة 
  
39/ 3 – حمود بن محمد بن عبد السلام بن عبد الله  بن أمير 
وأعقب:
40/ 1 – عبد السميع 40/ 2 – عبد الناصر 40/ 3 – عفيف            40/ 4 – برهان     
40/ 1 – عبد السميع بن حمود بن محمد بن عبد السلام 
وأعقب: 
41/ 1 –   
39/ 3 – سلطان بن محمد بن عبد السلام بن عبد الله  بن أمير 
وأعقب: 
40/ 1 – عبد الخالق       40/ 2 – هاني 
40/ 3 – رشيد  40/ 4 – ربيع      
39/ 1 – عبد الخالق بن سلطان بن محمد بن عبد السلام بن عبد الله بن أمير 
وأعقب: 
40/ 1 –  
ـــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــ 
39/ 2 – عبد الوهاب بن سعيد بن أحمد بن عبد الله بن أمير بن محمد بن الحسين بن محمد بن إبراهيم بن عبد الرحمن الجنيد
وأعقب:
40/ 1 – محمد 40/ 2 – عبدالله  
40 / 3 – إبراهيم  
40 / 1 – محمد بن عبد الوهاب بن سعيد بن أحمد بن عبد الله بن أمير 
وأعقب: 
41/ 1 –         
2/40- عبدالله بن عبدالوهاب بن سعيد بن أحمد بن عبدالله بن أمير 
واعقب: 
1/40-     2/40
ــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــ 
37 / 4 – محمد بن عبد الله بن أمير بن محمد بن الحسين بن محمد بن إبراهيم بن عبد الرحمن الجنيد
وأعقب: 
38/ 1 – صالح 38/ 2- محمد 
38/ 3 – عبدالغني 
38 / 1 – صالح بن محمد بن عبد الله بن أمير 
وأعقب: 
39/ 1 – محمد            2/39-عبداللطيف 
3/39- عبدالجليل (×) 
39/ 1 – محمد بن صالح بن محمد بن عبد الله بن أمير 
وأعقب:
40/ 1 – عبد القادر    40/ 2 – عبد الله 
40/ 3 – منصور   
40/ 1 – عبد القادر بن محمد بن صالح بن محمد بن عبد الله بن أمير 
وأعقب:
41/ 1 – محمد            41/ 2 – أمير
2/39 - عبداللطيف بن صالح بن محمد بن عبدالله بن أمير 
واعقب: 
1/40- أحمد              2/40- أمين 
3/40 - منير 
2/38 - محمد بن محمد بن عبدالله بن أمير 
واعقب: 
1/39- عبدالجليل           2/39- عبدالعزيز
1/39- عبدالجليل محمد بن محمد بن عبدالله بن أمير 
واعقب: 
1/40-          2/40 - 
3/38 - عبدالغني بن محمد بن عبدالله بن أمير 
واعقب: 
1/39- محمود
ــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــ
""")
print("Part 8 written")
