with open('source_lineage.txt', 'a', encoding='utf-8') as f:
    f.write("""
أعقاب شارح البحر:

          أعقاب=
سلطان بن علي بن عبد الله بن محمد بن عبد الله بن عبَّاد 
37/ 1 – عبد الله  37/ 2 – سيف 
37/ 2 – غالب 
37/ 1 – عبد الله بن سلطان بن علي  
وأعقب :
38/ 1 – ناجي ليس له عقب  

37/ 2 – سيف بن سلطان بن علي
وأعقب:  
38/ 1 – علي       38/ 2 – عبد ه
38/ 1 – علي بن سيف بن سلطان بن علي 
وأعقب :
39/ 1 – محمد      39/ 2 – منصور  
39/ 3 – أحمد      39/ 4 – سعيد 
39/ 5 – عبد العزيز     39/ 6 – أمين  
39/ 7 – محمود       39/ 8 – عبد الرحمن 
39/ 1 – محمد  بن علي بن سيف بن سلطان      
وأعقب :
40/ 1 – عبد العزيز       40/ 2 – محمد  
40/ 3 – عبد الإله        40/ 4 – هاشم  
40/ 5 – محمود 
39/ 2 – منصور بن علي بن سيف بن سلطان  
وأعقب : بنات 
39/ 3 – أحمد بن علي بن سيف بن سلطان  
وأعقب : لم يعقب 

39/ 4 – سعيد بن علي بن سيف بن سلطان  
وأعقب :
40/ 1 – عبد الصمد  40/ 2 – محمود   
40/ 3 – زايد    
39/ 5 – عبد العزيز بن علي بن سيف بن سلطان  
وأعقب :
40/ 1 – فواز   
39/ 6 – أمين  بن علي بن سيف بن سلطان  
وأعقب :
40/ 1 – مهدي  40/ 2 – محمد  
40/ 3 – محمود   
39/ 7 – محمود بن علي بن سيف بن سلطان  
وأعقب : بنات 
39/ 8 – عبد الرحمن بن علي بن سيف بن سلطان  
وأعقب :
40/ 1 – محمد  40/ 2 – محمود  
38/ 2 – عبد ه بن سيف بن سلطان  
وأعقب:
39/ 1 – يحي  39 / 2 – أحمد   
39/ 1 – يحي بن عبد ه بن بن سيف بن سلطان 
وأعقب :
40/ 1 – أمين   40/ 2 – محمد   
40/ 2 – أحمد     
40/ 1 – أمين بن يحي بن عبد ه بن بن سيف بن سلطان..... وأعقب: 
41/ 1 – محمد  
39/ 2 – أحمد بن عبده بن سيف بن سلطان  
وأعقب :
40/ 1 – وليد    40/ 2 – خليل    
40/ 3 – معاذ    40/ 4 – مؤيد    
40/ 2 – خليل بن أحمد بن عبده بن سيف بن سلطان  
وأعقب :
41/ 1 –  
40/ 3 – معاذ بن أحمد بن عبد ه بن بن سيف بن سلطان  
وأعقب :
41/ 1 –

37/ 2 – غالب بن سلطان بن علي بن عبد الله بن محمد بن عبد الله بن عبَّاد 
وأعقب :
38/ 1 – عبد الغني 38/ 2 – عبده
38/ 3 – حميد 
38/ 1 – عبد الغني بن غالب بن  سلطان  
وأعقب : بنات 
38/ 2 – عبده بن غالب بن  سلطان  
وأعقب : بنات 

38/ 3 – حميد بن غالب بن  سلطان بن علي بن عبد الله بن محمد بن عبد الله بن عبَّاد 
وأعقب :
39/ 1 – أحمد  39/ 2 – عبده
39/ 1 – أحمد بن حميد بن غالب بن  سلطان  
وأعقب :
40/ 1 – عبد الرحمن   40/ 2 – محمد 40/ 3 – عبد الله 
40/ 1 – عبد الرحمن بن احمد بن حميد بن غالب بن  سلطان   
وأعقب :
41/ 1 – مؤيد   41/ 2 – محمد 
39/ 2 – عبده بن حميد بن غالب بن  سلطان  
وأعقب :بنات 
 
39/ 1 – عبد الوهاب بن هزاع  بن أحمد  بن منصور بن علي بن عبد الله بن محمد بن عبد الله بن عبَّاد 
وأعقب :
40/ 1 – 40/ 2 –
39/ 2 – علي بن هزاع  بن أحمد  بن منصور بن علي بن عبد الله بن محمد بن عبد الله بن عبَّاد 
وأعقب : 
40/ 1- محمد  
 
39/ 1 – محمد بن عبد الحميد بن  سعيد بن عبد الملك بن علي بن عبد الله بن محمد بن عبد الله بن عبَّاد 
وأعقب:
40/ 1 – عبد الله      40/ 2 – محمود 
40/ 3 – محمد         40/ 4 – عبد الرحمن  
40/ 1 – عبد الله بن محمد بن عبد الحميد بن  سعيد بن عبد الملك 
وأعقب :
41/ 1 – مراد           41/ 2 – عبد السلام 41/ 3 – عبد الرحمن 
40/ 2 – محمود بن محمد بن عبد الحميد بن  سعيد بن عبد الملك 
وأعقب :
41/ 1 – محمد 
40/ 3 – محمد بن محمد بن عبد الحميد بن سعيد بن عبد الملك ..... وأعقب:
41/ 1 – أيمن 41 / 2 – 
40/ 4 – عبد الرحمن بن محمد بن عبد الحميد بن  سعيد بن عبد الملك 
وأعقب :
41/ 1 – 41 / 2 –             
39/ 2 – منصور بن عبد الحميد بن  سعيد بن عبد الملك بن علي بن عبد الله بن محمد بن عبد الله بن عبَّاد 
وأعقب :
40/ 1 – عبد الباسط      40/ 2 – عبد الحكيم 40/ 3 – مصطفى                       
40 / 1 – عبد الباسط  بن  منصور بن عبد الحميد بن  سعيد بن عبد الملك 
وأعقب :
41/ 1 – محمد 
40/ 2 – عبد الحكيم بن  منصور بن عبد الحميد بن  سعيد بن عبد الملك 
وأعقب :
41/ 1 – أسامة 

36 / 6 – منصور  بن علي بن عبد الله بن محمد بن عبد الله بن عباد 
وأعقب :
37 / 1 – 37 / 2 –
36/ 7 – عبد الملك  بن علي بن عبد الله بن محمد بن عبد الله بن عباد 
وأعقب :
37/ 1 – 37/ 2 – 

       أعقاب =  
حسن بن عبَّاد بن محسن بن أحمد الجنيد بن محمد جمال الدين 
37/ 1 – منصور  بن علي بن غالب بن عبد القوي علي بن عبد الله بن حسن بن عبَّاد  
وأعقب :
38/ 1 – عصام    38/ 2 - 
 
36/ 1 –  محمد بن عبد الجبار  بن علي بن عبد الله بن حسن بن عبَّاد  
وأعقب :
37 / 1 –  إسماعيل 37/ 2 – غالب 
37/ 3 – سيف 

          أعقاب =
حسن بن علي بن إسماعيل بن عبد الله بن عبَّاد بن محسن بن أحمد الجنيد بن محمد جمال الدين 
38/ 1 –  أحمد بن محمد بن حيدر بن حسن بن علي  بن إسماعيل بن عبد الله بن عبَّاد  
وأعقب :
39/ 1 – محمد    39/ 2 – حمود 
39/ 3 – عبد الوهاب 39/ 4 – سعيد 
39/ 1 – محمد بن احمد بن محمد بن حيدر 
وأعقب :
40/ 1 – خالد      40/ 2 – حسين 
40/ 3 – معاذ
40/ 1 – خالد بن محمد بن احمد بن محمد بن  حيدر 
وأعقب :
41/ 1 – محمد 
40/ 2 – حسين بن محمد بن أحمد بن محمد بن  حيدر 
وأعقب :
41/ 1 – 
40/ 3 – معاذ بن محمد بن احمد بن محمد بن  حيدر 
وأعقب :
41 / 1 – 
39/ 2 – حمود احمد بن محمد بن  حيدر 
وأعقب :
40/ 1 – عبد المولى      40/ 2 – عبد الكافي 40/ 3 – محمد        40/ 4 – كمال 
40/ 1 – عبد المولى بن حمود احمد بن محمد بن  حيدر 
وأعقب :
41/ 1 – مصطفى 
39/ 3 – عبد الوهاب احمد بن محمد بن  حيدر  
وأعقب :
40/ 1 – عامر        40/ 2 – علوان 
40/ 3 – علاء 
40/ 1 – عامر بن عبد الوهاب احمد بن محمد بن  حيدر 
وأعقب :
41/ 1 – حسين 
39/ 4 – سعيد احمد بن محمد بن  حيدر 
وأعقب :
40/ 1 – هيثم 40/ 2 – أحمد 
 
39/ 1 –  عبد الرحمن بن إسماعيل بن عبد الله بن أحمد بن حسن بن علي بن إسماعيل بن عبد الله بن عبَّاد 
وأعقب :
40/ 1 –  محمد   40/ 2 – عبد الملك    
39/ 2 – محمد بن إسماعيل بن عبد الله بن أحمد بن حسن بن علي  بن إسماعيل بن عبد الله بن عبَّاد 
  وأعقب :
40/ 1 – توفيق   40/ 2 – عبد الله  
40/ 3 – محمود - متوفى
40/ 1 – توفيق بن محمد بن إسماعيل  
وأعقب :
41/ 1 –  41/ 2 – 
40/ 2 – عبد الله بن محمد بن إسماعيل  
وأعقب :
41/ 1 –  مروان 41/ 2 – محمود 
39/ 3 – سعيد بن إسماعيل بن عبد الله بن أحمد بن حسن بن علي بن إسماعيل بن عبد الله بن عبَّاد 

وأعقب :
40/ 1 – محمد  40/ 2 –  محفوظ 
40/ 3 – هاشم   40/ 4 –  جيلان    
40/ 5 – عدنان  
____

39/ 1 – أحمد بن محمد بن عبد الله بن أحمد بن حسن بن علي  بن إسماعيل بن عبد الله بن عبَّاد 
وأعقب :
40/ 1 – عبد السلام  40/ 2 –  سعيد    
40/ 3 – عبد العليم  40/ 4 –  حميد    
40/ 5 – محمد 
40/ 1 – عبد السلام بن أحمد بن محمد بن عبد الله بن أحمد بن حسن بن علي بن إسماعيل بن عبد الله بن عباد 

وأعقب :
41/ 1 – رياض 41/ 2 –  سمير    
41/ 3 – أحمد 
40/ 2 –  سعيد بن أحمد بن محمد بن عبد الله بن أحمد بن حسن بن علي بن إسماعيل بن عبد الله بن عباد 

وأعقب :
41/ 1 – 41 / 2 –     41 / 3 – 41 / 4 –     
40/ 3 – عبد العليم  بن أحمد بن محمد بن عبد الله بن أحمد بن حسن بن علي  بن إسماعيل بن عبد الله بن عباد 
وأعقب :
41/ 1 – فارس 41/ 2 –  مروان    
40/ 4 – حميد بن أحمد بن محمد بن عبد الله بن أحمد بن حسن بن علي  بن إسماعيل بن عبد الله بن عباد 

وأعقب :
41/ 1 – 41/ 2 –     
40/ 5 – محمد بن أحمد بن محمد بن عبد الله بن أحمد بن حسن بن علي  بن إسماعيل بن عبد الله بن عباد 
  
وأعقب :
41/ 1 – 41/ 2 –     41/ 3 – 41/ 4 –  
39/ 2 – عبد الوهاب بن محمد بن عبد الله بن أحمد بن حسن بن علي  بن إسماعيل بن عبد الله بن عباد  
وأعقب :
40/ 1 – نبيل 40/ 2 –  علي    
__ 
38/ 1 – مهيوب بن سلطان بن مهيوب بن عبادي بن علي بن إسماعيل بن عبد الله بن عباد 
وأعقب :
39/ 1 – أحمد 39/ 2 – يوسف     
37/ 2 – عبد الرب بن مهيوب بن عبادي بن علي  بن إسماعيل بن عبد الله بن عباد 
وأعقب :
38/ 1 – سعيد   
38/ 1 – سعيد بن عبد الرب 
وأعقب :
39 / 1 –  
  

              أعقاب =  
جيلان بن عبَّاد بن محسن بن أحمد الجنيد بن محمد جمال الدين  
37/ 1 – إسماعيل بن حسن بن إسماعيل بن  عباس بن علي  بن جيلان بن عبَّاد 
وأعقب :
38/ 1 – محمد  
38/ 1 – محمد بن إسماعيل بن حسن بن إسماعيل 
وأعقب :
39/ 1 – أحمد     39/ 2 – إسماعيل   
39/ 3 – سعيد   39 / 4 – عبد الكريم   
39/ 1 – أحمد بن محمد بن إسماعيل بن حسن بن إسماعيل  
وأعقب :
40/ 1 – محمد   
40/ 1 – محمد بن أحمد بن  محمد بن إسماعيل 
وأعقب :
41/ 1 – عبد الخالق  41/ 2 – خليل   
41/ 3 – مراد        41/ 4 – محمد   
41/ 5 – وليد 
  41/ 1 – عبد الخالق  بن محمد بن أحمد بن  محمد بن إسماعيل 
وأعقب :
42/ 1 – علاء   42/ 2 – مصطفى ( شهيد)  42/ 3 - زيد

39/ 2 – إسماعيل بن محمد بن إسماعيل بن حسن بن إسماعيل 
وأعقب :
40/ 1 – عبد الرحمن     
40/ 1 – عبد الرحمن بن  إسماعيل بن  محمد بن إسماعيل 
41/ 1 – محمد       41/ 2 – ماجد       
41/ 3 – وليد   
41/ 1 – محمد بن عبد الرحمن بن  إسماعيل     
وأعقب :
41/ 1 – عبد الرحمن                   

39/ 3 – سعيد بن محمد بن إسماعيل بن حسن بن إسماعيل  
وأعقب :
40/ 1 – محمد   40/ 2 – عبد الله ( لم يعقب ) 
40/ 1 – محمد بن سعيد  بن  محمد بن إسماعيل 
وأعقب :
41/ 1 – عبد الرؤوف  41/ 2 – سلطان 41/ 3 – وهيب  
41/ 1 – عبد الرؤوف بن محمد بن سعيد  بن  محمد بن إسماعيل 
وأعقب :
41/ 1 – ذياب   
41/ 2 – سلطان بن  محمد بن سعيد  بن  محمد بن إسماعيل   
وأعقب :
41/ 1 – زايد   

39/ 4 – عبد الكريم بن  محمد بن إسماعيل بن حسن بن إسماعيل  
وأعقب :
40/ 1 – سعيد 40/ 2 – هزاع  ( ولا عقب له ) 
40/ 1 – سعيد بن عبد الكريم بن  محمد بن إسماعيل  
وأعقب :
41/ 1 – فيصل 41/ 2 – قاسم 
41/ 3 – عارف 41/ 4 – سمير
41/ 5 – أحمد 41/ 6 – عبد الكافي 
41/ 7 – يوسف 41/ 8 – داؤود 
41/ 2 – قاسم بن سعيد بن عبد الكريم بن محمد بن إسماعيل 
وأعقب :
42/ 1 – مولاي علي 
 
38/ 1 – أحمد بن منصور بن حسن بن إسماعيل بن  عباس 
وأعقب :
39/ 1 – محمد  39/ 2 – عبد الله   
39/ 2 – عبد الله بن أحمد بن منصور بن حسن بن إسماعيل بن عباس 
وأعقب :
40/ 1 – يوسف  40/ 2 – مؤيد    
40/ 3 – عمر  40 / 4 – محمد    
38/ 2 – عبد الجليل بن أحمد بن منصور بن حسن بن إسماعيل بن عباس
وأعقب: 
39/ 1 – محمد  39/ 2 – عبد الكريم    
39/ 3 – أحمد  39/ 4 – يحي   
39/ 1 – محمد بن عبد الجليل بن أحمد بن منصور بن حسن بن إسماعيل بن عباس 
وأعقب:
40/ 1 – وائل   
39/ 2 – عبد الكريم بن عبد الجليل بن أحمد بن منصور 
وأعقب :
40/ 1 – مصطفى     
39/ 3 – أحمد بن عبد الجليل بن أحمد بن منصور  
وأعقب :
40/ 1 – جمال    
39/ 4 – يحي عبد الجليل بن أحمد بن منصور  
وأعقب :
40/ 1 – عبد الله 40/ 2 – يوسف    
40/ 3 – علي  40/ 4 – موسى   
37/ 3 – محمد بن منصور بن حسن بن إسماعيل بن  عباس 
وأعقب :
38/ 1 – 38/ 2 –

39/ 1 – علي بن هزاع بن عبد الوهاب بن حسن بن إسماعيل بن عباس بن علي بن جيلان بن عبَّاد 
وأعقب
40/ 1 – جلال     40/ 2 – يعقوب  
40/ 3 – حسن     40/ 4 – حسين      
40/ 5 – يونس    
[ ملاحظة: عبد الحافظ ليس من ولد علي هزاع وإنما تبناه بعد أن وجده رضيعا وهذا حتى لا تختلط الأنساب] وذكرنا ذلك للتنبيه..
 
38/ 2 – أحمد بن عبد الوهاب بن حسن بن إسماعيل بن عباس بن علي  بن جيلان بن عباد 
وأعقب :
39/ 1 – ابراهيم  39/ 2 – حمود 
39/ 3 – محمد 39/ 4 – عبد الحكيم 
39/ 1 – إبراهيم بن أحمد بن عبد الوهاب بن حسن بن إسماعيل بن عباس بن علي بن جيلان  
وأعقب :
40/ 1 – وائل   
38/ 3 – محمد بن عبد الوهاب بن حسن بن إسماعيل بن  عباس بن علي  بن جيلان 
وأعقب :
39/ 1 – عبد الباري      39/ 2 – علي  39/ 3 – عبد الله 
39/ 1 – عبد الباري بن محمد بن عبد الوهاب بن حسن بن إسماعيل بن  عباس بن علي  بن جيلان

وأعقب :
40/ 1 –        40/ 2 – 40/ 3 – 
39/ 2 – علي بن محمد بن عبد الوهاب بن حسن بن إسماعيل بن  عباس بن علي  بن جيلان  
وأعقب :
40/ 1 – أسامة 40/ 2 – يونس 
39/ 3 – عبد الله بن محمد بن عبد الوهاب بن حسن بن إسماعيل بن عباس بن علي بن جيلان 
وأعقب :
40/ 1 – احمد 

37 / 3 – محمد بن حسن بن إسماعيل بن عباس بن علي بن جيلان 
وأعقب :
38/ 1 – عبد الواسع         38/ 2 – علي  
38/ 1 – عبد الواسع بن محمد بن حسن بن إسماعيل بن عباس بن علي بن جيلان 
وأعقب :
39/ 1 – أمين           39/ 2 – محمد  
39/ 3 – عبد الرحمن 39/ 4 – ماجد   
39/ 1 – أمين بن عبد الواسع بن محمد بن حسن 
وأعقب :
40/ 1 – محمد 40/ 2 – أسامة   
40/ 3 – مهدي 40/ 4 – مروان   
39/ 2 – محمد بن عبد الواسع بن محمد بن حسن 
وأعقب :
40/ 1 – حسن 40/ 2 – أحمد    
40/ 3 – يعقوب  
38/ 2 – علي بن محمد بن حسن بن إسماعيل بن  عباس بن علي بن جيلان  
وأعقب :
39/ 1 – إبراهيم 
""")
print("Part 2 written")
