with open('source_lineage.txt', 'a', encoding='utf-8') as f:
    f.write("""
**////****
                أعقاب //  
محمد بن محمد بن أحمد بن عثمان بن محمد بن محمد بن إبراهيم بن عبد الرحمن الجنيد

أعقاب // محمد بن عبد المعطي بن محمد بن محمد بن أحمد بن عثمان   
وأعقب : 
40/ 1 – أحمد 40/ 2 –  محمد 40/ 3 - إبراهيم 40/ 4 - عبد المعطي   40/ 5 – عبد السلام  
40/ 6 – عز الدين  40/ 7 – عبد الرؤوف 
40/ 8 – أمين        40/ 9 – نجيب 

40/ 1 – أحمد بن  محمد بن عبد المعطي بن محمد بن محمد بن أحمد بن عثمان  
وأعقب: 
41/ 1 – رشيد 
وأعقب : 
42/ 1 - أحمد  42/ 2 - 
___
40/ 2 – محمد بن  محمد بن عبد المعطي 
وأعقب : 
41/ 1 – عبد الوهاب 41/ 2 – مصطفى   
41/ 3 - عبد الخالق  41/ 4 - حسين    
41/ 5 – صادق    
41/ 1 – عبد الوهاب بن محمد بن  محمد بن عبد المعطي     
وأعقب : 
42/ 1 - محمد  42/ 2 – أحمد 
_____
41/ 2 – مصطفى بن محمد بن  محمد بن عبد المعطي 
وأعقب : 
42/ 1 - محمد          42/ 2 – أحمد   
42/ 3 -                   42/ 4 - 
___
 41/ 3 - عبد الخالق بن  محمد بن  محمد بن عبد المعطي 
وأعقب : 
42/ 1 - محمد 42/ 2 – مصطفى   
42 / 3 - حسين    
__
41/ 4 – حسين بن محمد بن  محمد بن عبد المعطي 
وأعقب : 
42/ 1 -     
____
41/ 5 – صادق بن  محمد بن  محمد بن عبد المعطي 
وأعقب : 
42/ 1 - محمد  
==========
40/ 2 - إبراهيم بن  محمد بن عبد المعطي 
وأعقب : 
41/ 1 – عبد الرحمن        41/ 2 –  مختار   
41/ 3 - أمين             41/ 4 - نبيل (شهيد)    
41/ 5 - محمد               41/ 6 – سمير
41 / 7 – مصطفى     
41/ 1 – عبد الرحمن بن ابراهيم بن  محمد بن عبد المعطي 
وأعقب : 
42/ 1 - محمد  42/ 2 – أحمد   
42/ 3 – زين العابدين 
_____
41/ 2 – مختار بن ابراهيم  بن  محمد بن عبد المعطي  
وأعقب : 
42/ 1 - عمر                42/ 2 – بدر  
42/ 3 -  محمد (شهيد)  42/ 4 – إبراهيم 
____
41/ 3 - أمين بن ابراهيم بن  محمد بن عبد المعطي  
وأعقب : 
42/ 1 - إبراهيم       42/ 2 – محمد   
42/ 3 - الحمزة    
____
41/ 4 – محمد بن إبراهيم بن  محمد بن عبد المعطي 
وأعقب : 
42/ 1 - إبراهيم            42/ 2 – أحمد       
____
41/ 5 – الشهيد نبيل بن ابراهيم بن  محمد بن عبد المعطي 
وأعقب : 
42/ 1 – المطهر   
___
41/ 6 – سمير بن ابراهيم بن  محمد بن عبد المعطي  
وأعقب : 
42/ 1 - الهزبر          42/ 2 – محمد   
42/ 3 – إبراهيم 
__
41/ 6 – مصطفى بن ابراهيم بن  محمد بن عبد المعطي 
وأعقب : 
42/ 1 - 
**===========***
40/ 4 - عبد المعطي بن  محمد بن عبد المعطي    
وأعقب : 
41/ 1 - أحمد          41/ 2 – محمد  
*==========/=***
40/ 5 – عبد السلام بن  محمد بن عبد المعطي 
وأعقب : 
41/ 1 – تامر        41/ 2 –  41/ 3 – 
**======*)****)
40/ 6 – عز الدين بن  محمد بن عبد المعطي 
وأعقب : 
41/ 1 – 41/ 2 –  
**========**
40/ 7 – عبد الرؤوف بن  محمد بن عبد المعطي 
وأعقب : 
41/ 1 -  41/ 2 – 41/ 3 -    41/ 4 –  **=======****  
40/ 8 – أمين بن  محمد بن عبد المعطي 
وأعقب : 
41/ 1 -  41/ 2 – 41/ 3 -    41/ 4 –     ***==========** 
40/ 9 – نجيب بن  محمد بن عبد المعطي 
وأعقب : 
41/ 1 -  41/ 2 –  
***=======***
///////////////
              أعقاب // 
يحي بن عبد المعطي بن 
وأعقب: 
40/ 1 – عبد العزيز بن يحي بن عبد المعطي 
وأعقب: 
41/ 1 – أمين          41/ 2 – عمر  
41/ 3 – محمد  
____
41/ 1 – أمين بن عبد العزيز بن يحي بن عبد المعطي     وأعقب:
42/ 1 – مهدي   42/ 2 – محمد
____
42/ 1 – عمر بن عبد العزيز بن يحي بن عبد المعطي 
وأعقب : 
42/ 1 – مبارك   42/ 2 – مبروك 
_____
41/ 3 – محمد بن عبد العزيز بن يحي بن عبد المعطي 
وأعقب: 
42/ 1 – وسام   42/ 2 - 
ـــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــ
40/ 2 – أحمد بن يحي بن عبد المعطي  
وأعقب : 
41/ 1 – محمد            41/ 2 – عدنان 
41/ 3 – عبد الملك       41/ 4 – فضل 
41/ 5 – سهل             41/ 6 – عبد الله      
41/ 7 –                41/ 8 – 
____
41/ 1 – محمد بن أحمد بن يحي بن عبد المعطي 
وأعقب: 
42/ 1 – علوي          42/ 2 – عيدروس    
42/ 3 –                  42 / 4 – معاذ 
42/ 5 –               42/ 6 -        
42/ 7 –               42/ 8 – 
____
41/ 2 – عدنان بن أحمد بن يحي بن عبد المعطي 
وأعقب: 
42/ 1 –            42/ 2 –     
42/ 3 -                    42/ 4 - 
____
41/ 3 – عبد الملك بن أحمد بن يحي بن عبد المعطي   
وأعقب : 
42/ 1 –       42/ 2 -     
42/ 3 -                42/ 4 -
__
41/ 4 – فضل  بن  أحمد بن  يحي بن عبد المعطي  
وأعقب: 
42/ 1 –           42/ 2 - 
أعقاب شارح البحر:
___
41/ 5 – سهل بن أحمد بن يحي بن عبد المعطي 
وأعقب : 
42/ 1 –           42/ 2 - 
__
41/ 6 – عبد الله بن أحمد بن  يحي بن عبد المعطي   وأعقب : 
42/ 1 –          42/ 2 - 
ـــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــ
40/ 3 – علي بن يحي بن عبد المعطي
وأعقب: 
41/ 1 – مصطفى          41/ 2 – مختار 
41/ 3 – عبد الرحمن      41/ 4 – صادق  
41/ 5 – زيد                 41/ 6 – يوسف 
41/ 7 – عبد الوهاب   41/ 8 – خالد 
__>_>
41/ 1 – مصطفى بن علي بن يحي بن عبد المعطي 
وأعقب: 
42/ 1 –            42/ 2 –      
42/ 3 –            42/ 4 – 
___
41/ 2 – مختار بن علي بن يحي بن عبد المعطي 
وأعقب : 
42/ 1 –  محمد            42/ 2 – عمر     
42/ 3 – علي 
____
41/ 3 – عبد الرحمن بن علي بن يحي بن
بن عبد المعطي 
وأعقب : 
42/ 1 –            42/ 2 - 
___
41/ 4 – صادق بن علي بن يحي بن عبد المعطي 
وأعقب : 
42/ 1 –  42/ 2 - 
_____
42/ 5 – زيد بن علي بن يحي بن عبد المعطي 
وأعقب: 
42/ 1 –  مطهر  42/ 2 - 
____
41/ 6 – يوسف بن علي بن يحي بن عبد المعطي 
وأعقب: 
42/ 1 –  42/ 2 – 
__
41/ 7 – عبد الوهاب بن علي بن يحي بن عبد المعطي 
وأعقب: 
42/ 1 –  42/ 2 – 
_____
41/ 8 – خالد بن علي بن يحي بن عبد المعطي 
وأعقب : 
42/ 1 –  42/ 2 – 
ــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــ
40/ 4 – عبد الرحمن بن  يحي بن عبد المعطي 
وأعقب : 
41/ 1 – أسامة   41/ 2 – بسام   41/ 2 – 
____
41/ 1 – أسامة بن  عبد الرحمن بن  يحي بن عبد المعطي 
وأعقب: 
42/ 1 –  42/ 2 – 42/ 3 –  42/ 4 – 
_____
41/ 2 – بسام بن عبد الرحمن بن يحي بن عبد المعطي 
وأعقب: 
42/ 1 –  42/ 2 – 
ـــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــ
40/ 5 – عبد الوهاب بن يحي بن عبد المعطي 
وأعقب: 
41/ 1 – عمار          41/ 2 –  41/ 3 –  
_____
41/ 1 – عمار بن  عبد الوهاب بن  يحي بن عبد المعطي 
وأعقب: 
42/ 1 –  42/ 2 –    
ـــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــ

40/ 6 – محمد بن يحي بن عبد المعطي 
وأعقب : 
41/ 1 – عبد الناصر             41/ 2 – عمار   41/ 3 – عبد الهادي             41/ 4 – عبد المعطي  
41/ 5 – محمد                  41/ 6 – أبو طالب  ___    
41/ 1 – عبد الناصر بن محمد بن يحي بن عبد المعطي 
وأعقب: 
42/ 1 – جمال   42/ 2 – مطهر     
___
41/ 2 – عمار بن محمد بن يحي بن عبد المعطي  وأعقب: 
42/ 1 – زيد  42/ 2 – 
ـــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــ
40/ 7 – عبد الجبار بن يحي بن عبد المعطي 
وأعقب: 
41/ 1 – محمد  41/ 2 – أمين    
>____
41/ 1 – محمد بن عبد الجبار بن يحي بن عبد المعطي 
وأعقب: 
42/ 1 –  42/ 2 –    
___
41/ 2 – أمين بن عبد الجبار بن يحي بن عبد المعطي   
وأعقب: 
42/ 1 –  42/ 2 –    ـــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــ
                  أعقاب = 
أحمد بن عبد المعطي بن الحاج محمد بن محمد بن أحمد بن عثمان
وأعقب: 
40/ 1 – إبراهيم          40/ 2 – محمد 
____
 40/ 1 – إبراهيم بن احمد بن عبد المعطي 
وأعقب: 
41/ 1 – عبد الرحمن         41/ 2 – فؤاد      
41/ 3 – محمد (×)            41/ 6 – فكري    41/ 7 – عفيف              41/ 8 – مراد   
    
41/ 1 – عبد الرحمن بن إبراهيم بن احمد بن عبد المعطي 
وأعقب: 
42/ 1 – إبراهيم            42/ 2 – أحمد  
42/ 3 – محمد              42/ 4 – هيثم 
____
41/ 2 – فؤاد  بن إبراهيم بن  احمد بن عبد المعطي وأعقب: 
42/ 1 – محمد   42/ 2 – أحمد  
____
41/ 3 – فكري بن إبراهيم بن احمد بن عبد المعطي 
وأعقب: 
42/ 1 –  42/ 2 – 
___
41/ 4 – عفيف بن إبراهيم بن  احمد بن عبد المعطي وأعقب: 

42/ 1 – إبراهيم  42/ 2 – 
_____
41/ 5 – مراد بن إبراهيم بن احمد بن عبد المعطي 
وأعقب: 
42/ 1 –   42/ 2 – 
ـــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــ
40/ 2 – محمد بن احمد بن عبد المعطي 
وأعقب: 
41/ 1 – عبد الرحمن  41/ 2 – عبد الصمد  
41/ 3 – عبد المعطي  41/ 4 – رأفت   
___
41/ 1 – عبد الرحمن بن محمد بن أحمد بن عبد المعطي 
وأعقب: 
42/ 1 – أحمد  
____
41/ 2 – عبد الصمد  بن محمد بن أحمد بن عبد المعطي    
وأعقب: 
42/ 1 – 
__  
41/ 3 – عبد المعطي بن محمد بن أحمد بن عبد المعطي 
وأعقب: 
42/ 1 – أحمد
_____
41/ 4 – رأفت بن محمد بن أحمد بن عبد المعطي  وأعقب: 
42/ 1 –    
ـــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــ 
                أعقاب = 
عبد الجليل  بن عبد المعطي بن الحاج محمد بن محمد بن أحمد بن عثمان
وأعقب: 
40/ 1 – محمد             40/ 2 – حسن  
40/ 3 –  هاشم                40/ 4 –  عبد العزيز 
__
40/ 1 – محمد بن عبد الجليل بن عبد المعطي 
وأعقب: 
41/ 1 – عبد الفتاح       41/ 2 – عدنان  
41/ 4 – أحمد      

41/ 1 – عبد الفتاح بن محمد بن عبد الجليل بن عبد المعطي    
 وأعقب: 
42/ 1 – هشام     
__
40/ 2 – حسن بن عبد الجليل بن عبد المعطي  
وأعقب: 
41/ 1 –  41/ 2 – 41/ 3 –  41/ 4 – 
____
40/ 3 – هاشم بن عبد الجليل بن عبد المعطي   وأعقب: 
41/ 1 –  41/ 2 – 41/ 3 –  41/ 4 – 
____
40/ 3 – عبد العزيز بن عبد الجليل بن عبد المعطي 
وأعقب: 
41/ 1 –  41/ 2 – 41/ 3 –  41/ 4 – 
ـــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــ

                  أعقاب =
محمد بن شرف بن محمد بن محمد بن أحمد بن عثمان
وأعقب: 
40/ 1 – علي              40/ 2 – عبد العزيز  
40/ 3 - عبد الله (×)     40/ 4 - محمد   
___
40/ 1 – علي بن محمد بن شرف 
وأعقب: 
41/ 1 – عبد القوي            41/ 2 – إبراهيم 
41/ 3 - جميل                   41/ 4 - مصطفى   
41/ 5 – صادق              41/ 6 – محمد    

41/ 1 – عبد القوي بن علي بن محمد بن شرف 
وأعقب: 
42/ 1 – أحمد   42/ 2 – محمد 
_____
41/ 2 – إبراهيم بن علي بن محمد بن شرف 
وأعقب: 
42/ 1 – محمد   42/ 2 – أحمد   
42/ 3 – عبد الله  
_____
41/ 3 – جميل بن علي بن محمد بن شرف 
وأعقب: 
42/ 1 – الهتار  42/ 2 – جمال 42/ 3 – مصطفى 42/ 4 – علوي  42 / 5 – محمد  42/ 6 – أحمد  
__
41/ 4 – مصطفى بن علي بن محمد بن شرف 
وأعقب: 
42/ 1 – مهند   42/ 2 – محمد  
ـــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــ
40/ 2 – عبد العزيز بن محمد بن شرف 
وأعقب:
41/ 1 – فاضل  41/ 2 –  عصام ( × ) 
41/ 3- عدنان    41/ 4 - عمر   
___
40/ 4 - محمد بن محمد بن شرف 
وأعقب: 
41/ 1 – شرف(×) 41/ 2 –  عبد الرحمن  
ــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــ 
                   أعقاب =  
حزام بن محمد بن محمد بن أحمد بن عثمان

38/ 3 - حزام بن محمد بن محمد بن أحمد بن عثمان بن محمد بن محمد بن إبراهيم بن عبد الرحمن الجنيد   

وأعقب : 
39/ 1 – محمد الكبير-            39/ 2 – يحي       
39/ 3 – محمد الصغير –    39/ 4 – عبد الحفيظ(×) 
__
39/ 1 – محمد الكبير- بن حزام بن محمد بن محمد بن أحمد بن عثمان   
وأعقب:     
40/ 1 – محمد بن عبد المجيد بن محمد الكبير - بن حزام 
وأعقب: 
42/ 1 – توفيق      42/ 2 – أحمد     
42/ 3 – إبراهيم     42/ 4 – عاصم      
42/ 5 – زيد 
___
42/ 1 – توفيق      
وأعقب: 
43/ 1 – زكريا   43/ 2 – محمد 
ـــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــ
39/ 2 – يحي بن حزام الكبير  
وأعقب: 
40/ 1 – إبراهيم   40/ 2 – عبد الله     
____
40/ 1 – إبراهيم بن يحي بن حزام الكبير 
وأعقب: 
41/ 1 – عبد الرحمن  41/ 2 -  عبد الباسط  
41/ 3 – عبد الحكيم  41/ 4 – محمود 

_____
41/ 1 – عبد الرحمن بن إبراهيم بن يحي بن حزام 
وأعقب: 
42/ 1 – محمد               42/ 2 –     
___
41/ 2 – عبد الباسط بن إبراهيم بن يحي بن حزام   
وأعقب: 
42/ 1 – 42/ 2 –    42/ 3 – 42/ 4 – 
_____
41/ 3 – عبد الحكيم بن إبراهيم بن يحي بن حزام 
وأعقب: 
42/ 1 – أيمن      42/ 2 – جواد    
_____
41/ 3 – محمود بن ابراهيم بن يحي بن حزام    وأعقب: 
42/ 1 – 42/ 2 –    42/ 3 – 42/ 4 – 
ـــــــــــــــــــــــــــــــــــ

40/ 2 – عبد الله بن يحي بن حزام 
وأعقب: 
41/ 1 – محمد   41/ 2 – عبد الحافظ   
41/ 3 – يوسف  
____
41/ 1 – محمد بن عبد الله بن يحي بن حزام 
وأعقب: 
42/ 1 – ماجد       42/ 2 – رشيد    
___
41/ 2 – عبد الحافظ بن عبد الله بن يحي بن حزام 
وأعقب: 
42/ 1 – 42/ 2 –    42/ 3 – 42/ 4 – 
____
41/ 3 – يوسف بن عبد الله بن يحي بن حزام 
وأعقب: 
42/ 1 – محمد      42/ 2 –    

ـــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــ
 39/ 3 – محمد بن محمد الصغير بن حزام 
وأعقب: 
41/ 1 – أحمد           41/ 2 – عبد العزيز 
41/ 3 - وجيه            41/ 4 - عبد الإله   
41/ 5 – عبد الرحمن  41/ 6 – فاضل  
41/ 7 – عدنان     
___
41/ 1 – أحمد بن محمد بن محمد الصغير بن حزام 
وأعقب: 
42/ 1 – محمد   41/ 2 – 
__
41/ 2 – عبد العزيز بن محمد بن محمد الصغير بن حزام 
وأعقب: 
42/ 1 –  42/ 2 – 
___
41/ 3 – وجيه بن محمد بن محمد الصغير بن حزام 
وأعقب: 
42/ 1 –  42/ 2 – 
___
41/ 4 – عبد الإله بن محمد بن محمد الصغير بن حزام
وأعقب: 
42/ 1 –  42/ 2 – 
__
41/ 5 – عبد الرحمن بن محمد بن محمد الصغير بن حزام    
وأعقب: 
42/ 1 –  42/ 2 – 
__
41/ 6 - فاضل بن محمد بن محمد الصغير بن حزام 
وأعقب: 
42/ 1 –  42/ 2 – 
__
41/ 7 - عدنان بن محمد بن محمد الصغير بن حزام 
وأعقب: 
42/ 1 –  42/ 2 – 
____

ـــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــ
                أعقاب = 
وجيه بن محمد بن محمد بن أحمد بن عثمان
وأعقب: 
39/ 1 – محمد            39/ 2 – عبد الرحمن   
39/ 3 – أحمد    
__
39/ 1 – محمد بن وجيه 
وأعقب:
40/ 1 – وجيه              40/ 2 - جمال 
40/ 3 - عبدالحكيم        40/ 4 - جميل 
40/ 5 - هشام               40/ 6 - فوزي 
40/ 7 - ماجد               40/ 8 - محمد

40/ 1 - وجيه بن محمد بن وجيه 
وأعقب: 
41/ 1 - سمير 
___
40/ 2 - جمال بن محمد بن وجيه 
وأعقب:
41/ 1- جميل              41/ 2 - محمد 
41/ 3 - محمود   

41/ 1 - جميل بن جمال بن محمد بن وجيه 
وأعقب: 
41/ 1 - سيف
___
41/ 2- محمد بن جمال بن محمد بن وجيه 
وأعقب: 
42/ 1- عبدالرؤوف                42/ 2- جمال
__
41/ 3 - محمود بن جمال بن محمد بن وجيه 
وأعقب: 
42/ 1- جمال
____
40/ 3 - عبدالحكيم بن محمد بن وجيه 
وأعقب: 
41/ 1- زكريا (شهيد)           41/ 2- علي 
_____
40/ 4 - جميل بن محمد بن وجيه 
وأعقب:
41/ 1- محمد 
___
40/ 5 - هشام بن محمد بن وجيه 
وأعقب:
41/ 1- كريم             41/ 2 -  محمد 41/ 3 مصطفى 
_____
40/ 6 - فوزي بن محمد بن وجيه 
وأعقب: 
41/ 1-  أشرف                41/ 2 - وجيه الدين   41/ 3 - محمد 
_____
40/ 7 - ماجد بن محمد بن وجيه 
وأغقب: (×)
__
40/ 8 - محمد بن محمد بن وجيه 
وأعقب: 
41/ 1 - أحمد          41/ 2 - عبدالله
____
39/ 2 - أحمد بن وجيه 
وأعقب: 
40/ 1  - عبدالإله       40/ 2 - عبدالملك    
40/ 3 - فضل
__
40/ 1- عبدالإله بن أحمد بن وجيه 
وأعقب: 
41/ 1-  محمد               41/ 2 - أحمد 
41/ 3 - مجد
___
40/ 2 - عبدالملك بن أحمد بن وجيه 
وأعقب: 
41/ 1 - وجيه                41/ 2 - حسين  
41/ 3 - بشير                41/ 4 - مالك 41/5 - أحمد
_____
40/ 3 - فضل بن أحمد بن وجيه 
وأعقب: 
41/ 1- حمزة
___
39/ 3 - عبدالرحمن بن وجيه 
وأعقب: 
40/ 1 - هيثم
ـــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــ
           أعقاب = 
فاضل بن محمد بن محمد بن أحمد بن عثمان
وأعقب : 
39/ 1 – عبد الجليل (×) قبول
ــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــ
""")
print("Part 5 written")
